[
    {
        "id": "lgjxz6q",
        "body": "It takes a conscientious effort to maintain friendships in adulthood. What's worse is that many people don't prioritize friendship, even though it is the best indicator of mental and physical health. You'll have to prioritize your current friends and try to proactively make friends with people at work and other social situations. I've actually lost someone I considered a good friend recently, so it sucks but life moves on.",
        "created_utc": 1722827880.0,
        "author": "Lopsided_Flight_5585",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgjxz6q/"
    },
    {
        "id": "lgjxgdp",
        "body": "Thank you for your opinion! It’s good to hear the perspective from strangers so I can see where the thoughts lie. I agree things need to be planned out especially for a big trip whether it’s with friends OR family. She’s such a last minute planner / wants everything also planned for her, so it’s hard to gauge what she is thinking. I heavily agree with you on a lot of points you made- glad I went but I think it would be a nightmare to try that twice. Let alone just hanging out with her for a day is too much especially after everything she did and didn’t even thank me for paying / booking most things. I feel like at the very least she could’ve done that or offered to pay for my meal or something, not that she owed me anything ofc but I definitely would’ve if the shoes were switched",
        "created_utc": 1722827644.0,
        "author": "Bingbong5869",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1e9602h/went_on_a_trip_with_a_close_friend_ive_now/lgjxgdp/"
    },
    {
        "id": "lgjwy81",
        "body": "Thanks for your kind words, it really helps in such a tough situation like this. Although, don’t you think if I keep talking about myself she won’t hear me even though she can read what I said? I feel she would maybe spiral again..",
        "created_utc": 1722827416.0,
        "author": "Bingbong5869",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1e9602h/went_on_a_trip_with_a_close_friend_ive_now/lgjwy81/"
    },
    {
        "id": "lgjuda9",
        "body": "Yeah I understand that completely, thank you for your insight!",
        "created_utc": 1722826278.0,
        "author": "Bingbong5869",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1e9602h/went_on_a_trip_with_a_close_friend_ive_now/lgjuda9/"
    },
    {
        "id": "lgju0oa",
        "body": "Well it’s their loss.  Time heals all wounds so they’ll eventually become a distant memory.  As for your cousin, unfortunately you don’t get to pick who you want for family, it’s inevitable that they’ll be in your life no matter what.  For your own peace of mind: I would be civil with them but it doesn’t mean you have to be on social terms.  Meaning you're not obligated to maintain long term communication.  It sounds like they're petty & untrustworthy enough to use it as group gossip fodder so I would keep conversation with them at arm's length.  They more than likely won't accept their responsibilities for what they did and if they ask: it's ok to tell them why you don't want to associate with them.  As for the group: give it time, they already turned on you, they'll all turn on each other, cousin included.",
        "created_utc": 1722826128.0,
        "author": "WorstHatFreeSoup",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ek8otd/talking_behind_back/lgju0oa/"
    },
    {
        "id": "lgjpsis",
        "body": "If you try to think about it from the outside perspective, everyone who is or was your friend, became close when you guys first met for any reason, and they became close to you cuz you guys were compatible for each other. \nWith time that compatibility changes as we change and if the difference of change between two people who are close becomes significantly high, they're evident to be separate at one point of time or another.\n\nFriendships are basically a promise of supporting each other in any way one can, it doesn't have to come with a tag, anyone at any point of life can do it for you, and if someone does, most probably that person becomes your friend, same goes for you doing something for others.\n\nSo you never lose all the friendships at once, anytime anywhere there's someone who's always your friend or at least has potential to become one, you just have to be optimistic enough about it.\n\nYeah being optimistic can be hard when you lose close friends, but it's life ups and downs keep happening, it's a cycle from misery to pleasure.",
        "created_utc": 1722824348.0,
        "author": "AlternativeDeep22GK",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgjpsis/"
    },
    {
        "id": "lgjkmxi",
        "body": "Yeah. Dude I agree with that. I suppose Everybody scare to try to new things. But you don’t have to leave them to eat you.\nYou have to confidence to jump to the new world and make new friends.\nYou will get over it. There’s nothing to scare of. Because that’s the way people lives.",
        "created_utc": 1722822207.0,
        "author": "Outrageous_Side_2181",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgjkmxi/"
    },
    {
        "id": "lgj9vpz",
        "body": "I have dreams about my ex-friends almost every night. I’m very lucky if my dream is not about them. And the dream presents this idyllic grand reconciliation and everything getting back to normal and my life being all sunshine and rainbows… and then I wake up. \n \nMy brain needs to cut the crap honestly. It’s so annoying when I have a good day and go to sleep and bam there they are again. But it is a way of your brain processing the emotions. \n\nRemember. Grief is the price we pay for love. \n\nHonestly these dreams are just evidence that you have capacity for love and deep emotional connection and that’s a great thing. You should look forward to experiencing this depth of feeling again with a friend you are more compatible with. You may even re-experience this with the same friend, who knows. But it would likely have to be redeveloped. I don’t know how long it’s been or what happened with you, but reconciliation will take time and huge emotional effort from both sides. You have to be stable enough to cope with it in order to restore the friendship. You know your friend very well. How will they react? Will they hold a grudge, or do you think they can see past what happened? These are all things you need to consider. \n\nIf you’re thinking of reaching out, give it time. Really think it through. Write out a message and leave it for days or even weeks. Think about it not only when you are feeling lonely and miserable, and not only when you have just woken up from one of these dreams, but also when you are calm. In a fleeting moment of peace in your current day to day life, take a second to again think about reaching out, how you think they would respond, do you have the emotional capacity to cope with the reconciliation right now, or are you likely to make more mistakes that would worsen the situation and disrupt your healing process. Write down how you feel in this moment. Because that is not worth it. No matter how much time you take to heal from this, if your friendship is true, your friendship will reform. Allow yourself to get to this point. Where their response makes no difference to your progress or your life. Let yourself get to the point where, if they offer rejection, you can simply take that as closure with no hard feelings. I’m waiting for this moment and plan to reach out as soon as it comes. But I know as long as I’m dreaming about them, still struggling to accept the breakup, and feeling very emotionally unstable, I am not ready.\n\nI have such vivid dreams it can be really hard to snap out of it in the morning and not let it affect your day. They can feel so real it is honestly horrible. I always give myself a few minutes in the morning to meditate and talk myself through the dream. I can remind myself that it is part of the journey and that they do not represent the reality of the situation I am in. \n\nThink of it like, your brain is working overtime in your sleep processing the emotions so you can move on faster. It’s a lot better to have the memories flooding through in your subconscious state than actively disrupting your day to day life. You really could make an inside out movie on this haha. Sending lots of good luck for the future and hope you begin to have lots of lovely dreams about all the good parts of life soon :))",
        "created_utc": 1722817795.0,
        "author": "New-Baby-7377",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ea5qok/just_woke_up_from_a_dream_about_my_best_friend/lgj9vpz/"
    },
    {
        "id": "lgj48x3",
        "body": "Yes, and you tend to reserve that closeness for your family members (spouses, children, parents, siblings)",
        "created_utc": 1722815540.0,
        "author": "cvfdrghhhhhhhh",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgj48x3/"
    },
    {
        "id": "lgj3vs4",
        "body": "Please don’t listen to all of these people telling you that you can’t make close friends past college - of course you can. I’m 50, and I have 5 very close girlfriends - one I met in my 30s online, two I met about 7 years ago at a job, and 1 I met about 10 years ago through local political work and 1 I met 10 years ago through our kids. \n\nI have other friendships too that ebbed and flowed over time. \n\nI will say that there is a certain type of closeness that is created in childhood and very young adulthood when you have all the time in the world to spend together, when you go through growth experiences together and when you are in the same place day in and day out. But my adult friendships are much much more stable, mutual, less codependent and deep in a different way. \n\nSo will it feel exactly the same as it did when you were 17? Probably not, but those friendships wouldn’t stay the same anyway, as you grow up, move, get jobs, and potentially get married and have children. \n\nIt’s ok. I promise you will have friends who love you and support you again.",
        "created_utc": 1722815397.0,
        "author": "cvfdrghhhhhhhh",
        "score": 8,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgj3vs4/"
    },
    {
        "id": "lgj2iex",
        "body": "I relate a ton 😭😭😭",
        "created_utc": 1722814858.0,
        "author": "sillybilly8102",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lgj2iex/"
    },
    {
        "id": "lgiuus8",
        "body": "Still have a few months till I finish school to move out",
        "created_utc": 1722811894.0,
        "author": "depressedavacado",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgiuus8/"
    },
    {
        "id": "lgishdt",
        "body": "Send him a text. Could it hurt? If he responds great, he might be also thinking of you. He might have changed his mind.",
        "created_utc": 1722810998.0,
        "author": "Sudden_Connection291",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1eittt5/today_is_his_birthday/lgishdt/"
    },
    {
        "id": "lgir0ed",
        "body": "I wrote things down, I wrote messages and letters and it helped me cope with pain. I hadn't sent some. Some I sent and had lots of regrets because I faced a cold receipt that is almost like 'so what, I'm still not interested in being friends with you. ' We're yet to talk because they keep postponing it. At this point, I don't think it's going to happen because I don't trust them anymore. If they came back around, acknowledge their handling of the situation wasn't acceptable, I would be willing to give it another go, otherwise it's not going to happen for me. I would say, protect your heart and let her go and see if she comes back around.",
        "created_utc": 1722810445.0,
        "author": "Sudden_Connection291",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lgir0ed/"
    },
    {
        "id": "lgion19",
        "body": "This happend to me and the advice I can give you is that even if its your fault dont beat yourself up about it. If you blame yourself all the time it will only feel worse and won't be fixed. I suggest find another group or another friend and talk to them about the situation if you feel comfortable. When you can just let it go and move on. I went through is and I now have a different group of friends and am happier",
        "created_utc": 1722809556.0,
        "author": "Emily1234201",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1eg6pp7/how_do_you_deal_with_it/lgion19/"
    },
    {
        "id": "lginqhh",
        "body": "Assuming you’re an adult now and no longer living with your parents, is being manipulative and a liar still serving you well?",
        "created_utc": 1722809219.0,
        "author": "Realistic-Jello6433",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lginqhh/"
    },
    {
        "id": "lgikje2",
        "body": "It would be the case, im afraid. I wanted to talk it out since i was rather confused that night over what all had transpired, and well, i was in quite a bit of panic. A year later, im still not sure if i should break that silence. My last message ever was I quote: \"We promised we would talk and figure out every problem we would encounter, remember?\". Its quite poetic, actually, even if i do say so myself, hahaha.",
        "created_utc": 1722808044.0,
        "author": "BlookyArt",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lgikje2/"
    },
    {
        "id": "lgijm2g",
        "body": "If you are both women and she was attracted to you, then she might be ashamed of that and that could be the reason she pulled away. She wanted to be first to break the friendship instead of being afraid that you will find out of her feelings and would want to pull away. It takes a lot of emotional maturity to be able to face this kind of situation and carry on a friendship after the incident. Like in my case, the person I was friends with chose to run away rather than experience a conversation which would actually lead to a stronger friendship bond. Sending a letter may give her time to ponder over things and even reach out.",
        "created_utc": 1722807713.0,
        "author": "Sudden_Connection291",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lgijm2g/"
    },
    {
        "id": "lgiahdf",
        "body": "It isn't \"normal\", I agree. If it were any other person, I would assume that I did do something (though still not sure what). But this has happened with this friend before, when we were much younger. Her whole family ignored me, and then we became friends again and everyone seemed to pretend it just didn't happen. I was too young to really question it then, as I assumed that I just \"did something wrong\" and should just be grateful I was back in their good graces. I appreciate your thoughts! Hopefully I'll be able to grow sooner than later. Right now it just feels awful.",
        "created_utc": 1722804511.0,
        "author": "Good-Cap-3396",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejafkq/confused_after_ghosted_by_longtime_friend/lgiahdf/"
    },
    {
        "id": "lgi7kix",
        "body": "From what you write, OP, it cannot be known why your long-time friend is no longer reaching out to you. Without a specific timeline of events leading up to this particular disappearance of your friend, the only deductions I can really make are that you may indeed have done something as it isn't normal for family members of a friend to socially ignore you. So if you would like some specific advice, I think you may need to share some more information on specific moments. Maybe then The Reason This Has Happened could be clearer.\n\nIn the meantime, I would suggest a way to process this would be: \n\n(1) Ask yourself what a true friend would have done in this situation, if they had really wanted you to know why they could no longer be your friend. Also, what is it you would have done yourself, if you had been in your friend's position? This way, you can slowly realise that it isn't all your fault and you're not the only one with faults.\n\n(2) Ask yourself what are you going to do to grow from this moment? You're allowed to feel confused and sad, but you cannot hope to move forward, giving too much control to your friend. You already know that your friend does not seem to be interested at the moment in your friendship. So you must do what we all try to do, those of us who have lost important friends: Try to regain the confidence we lost in ourselves. You still have a lot to offer other friends and potential new friendships. Learn what you can to become stronger and more confident. It is possible to not need someone who didn't even say \"goodbye\".",
        "created_utc": 1722803521.0,
        "author": "Successful_Gap_406",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejafkq/confused_after_ghosted_by_longtime_friend/lgi7kix/"
    },
    {
        "id": "lgi7cuy",
        "body": "This is the first time im hearing of this haappen to someone else, which makes me feel less alone in the world with these kinds of envounters. Thank you for sharing your story, it means a lot. I really hope you are at peace with this period of your life. As for myself, I am still in a dilema whether or not i should even bother sending a message since that might hurt me even more or nothing would come of it because the chances of this becoming a positive thing are slim to none.....",
        "created_utc": 1722803448.0,
        "author": "BlookyArt",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lgi7cuy/"
    },
    {
        "id": "lgi6uhi",
        "body": "Well, I'll try and give some optimism here to go against the grain. I was lucky to have a super close group of friends during college, and drifted apart from most of them in the several years after college. I was never friendless, but definitely worried that the time for making good friends had passed.\n\nI started my career two years ago, and have made some absolutely amazing friends through work. Not just \"work friends,\" either - we text regularly, hang out outside of work, and have gotten together multiple times over the summer (we're teachers). They already have circles of friends, as do I, but that doesn't mean we haven't been able to connect and form new friendships. Our friendships may not be exactly the same as the ones I had with my college group, but I would certainly say I feel just as close to them, only in different ways.",
        "created_utc": 1722803276.0,
        "author": "thefreecontestent",
        "score": 6,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgi6uhi/"
    },
    {
        "id": "lgi5yo0",
        "body": "Don’t know the full story. Maybe she had a Guilty conscience? or maybe didn’t have anything to say to you? ❤️",
        "created_utc": 1722802978.0,
        "author": "MysteriousUpstairs58",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ek3nde/i_saw_my_former_friend_at_a_mall_she_stared_in_ny/lgi5yo0/"
    },
    {
        "id": "lghxny7",
        "body": "I love myself. The way I am. I'm manipulative, and a liar but without those I couldn't have lasted with my parents \nThe only reason to change was if there was someone I cared about more than myself. And now they aren't here",
        "created_utc": 1722800146.0,
        "author": "depressedavacado",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lghxny7/"
    },
    {
        "id": "lghtp6a",
        "body": "I’m in this exact position. I cannot maintain friendships for the life of me. I’m about to graduate college in less than a year, and I’m off to go to grad school. I’m hoping as I get older it will be easier, but everyone I’ve thought were close friends has either drifted off, not put in anymore effort or aren’t interested anymore, or have ghosted me for reasons unknown to me. I feel kind of hopeless. I’ve started to try and appreciate time alone more. I don’t like going places without company because of my anxiety and fear that something bad is going to happen, so I’ve just turned into a homebody that just goes to the grocery store (with my boyfriend because I’m constantly followed when im just trying to shop), classes, the gym, and the bar occasionally (also with my boyfriend). I don’t really do much else.",
        "created_utc": 1722798767.0,
        "author": "JazzySharks",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lghtp6a/"
    },
    {
        "id": "lghtcfo",
        "body": "I'm sorry, it's tough. I was in a situation with a friend when I thought they had feelings for me. I played a part it in by 'playing into their actions', meaning responding with similar language and affection. However I brought it up in one conversation, that we need to stop this. However, after that they started coming up with reasons not to speak with me. We had one chat and then messaging fizzled and they ended things with me. So, it's not uncommon that this happens. I offered to have a conversation but they are still running from me. You can try to invite them to chat or send them a letter to see if that makes a difference. Good luck",
        "created_utc": 1722798648.0,
        "author": "Sudden_Connection291",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lghtcfo/"
    },
    {
        "id": "lghppbr",
        "body": "I wouldnt have my hopes up but I will update this if something happens :)",
        "created_utc": 1722797406.0,
        "author": "BlookyArt",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lghppbr/"
    },
    {
        "id": "lghlckn",
        "body": "I only say phone call because I believe it would be a very emotionally heavy conversation but do what’s best for you! I’ll be keeping my eye out for an update post",
        "created_utc": 1722795940.0,
        "author": "blueeberrrypie",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lghlckn/"
    },
    {
        "id": "lghan5a",
        "body": "You’re probably right. But surely over time you’d become less close with your old friends anyway?  From people moving away, becoming busy etc. I think going through uni together is a different level of closeness because you are experiencing independence at the same time and going through this special new experience together. I think the closeness probably just came from the fact that we spent 24/7 together. That sort of friendship definitely wouldn’t be sustainable beyond uni anyway.. so I suppose it’s just part of growing up.",
        "created_utc": 1722792372.0,
        "author": "New-Baby-7377",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lghan5a/"
    },
    {
        "id": "lgh90bh",
        "body": "Wait until you get older and discover that even when you have people who are willing to be your friends and you're on the same wavelength, you're unable to feel as close to them as you did to your old friends, because it was a young, intense person thing...",
        "created_utc": 1722791822.0,
        "author": "Ioa_3k",
        "score": 15,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgh90bh/"
    },
    {
        "id": "lgh8hjz",
        "body": "Me",
        "created_utc": 1722791645.0,
        "author": "gucchiprada",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgh8hjz/"
    },
    {
        "id": "lgh6t47",
        "body": "How long has it been do you mind me asking? Im guna do everything I can to try and make amends in the final year of university but yeah im so scared because being friends with them was the only thing that brought me joy",
        "created_utc": 1722791081.0,
        "author": "New-Baby-7377",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgh6t47/"
    },
    {
        "id": "lgh5mo6",
        "body": "You're right to be scared. I was in the same boat. After I lost my only best friend in my last year of university, I was never able to form anything more than aquaintanceships with people. Everyone else already has their circle of people they're close to. It is what it is; the older you get, the harder it is to even make friends, much less close friends.",
        "created_utc": 1722790683.0,
        "author": "Boethiah_The_Prince",
        "score": 17,
        "permalink": "/r/lostafriend/comments/1ejzqqt/anyone_else_scared_theyll_never_make_close/lgh5mo6/"
    },
    {
        "id": "lgh10p6",
        "body": "I’d like to think that in situations like these the person who did the dumping/ghosting is more likely to have a large degree of avoidant attachment. Instead of talking to you about issues they might be having with you they choose to bottle things up and see discarding as the only solution.",
        "created_utc": 1722789123.0,
        "author": "Lady_Whistlegirl91",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1ejhdav/book_rec_for_anyone_who_has_been_ghosted/lgh10p6/"
    },
    {
        "id": "lggyfu0",
        "body": "I know what you mean. My situation is similar but also different. 28m here. I befriended a woman about four years ago. We would talk all the time, then became absolute best friends. She was constantly coming to me with a new issue almost daily. I would always stop whatever it is I was doing and be there for her no matter what. Then when I needed someone to talk to, she would sometimes be there for me but most of the time she wouldn't be. I lost someone very dear to me and I was texting her how upset I was about it, then she messages me the next day and says \"hey im so sorry can you check my facebook and see if i've been hacked?\" I knew right then that she more than likely didn't care about me even though she has told me multiple times I was her best friend and she cared \"so deeply\" for me. The whole thing felt very one sided but I overlooked it because i really cared about her. We got along great, had the same sense of humor, same interests, same taste in music etc. She would always do things that were morally abhorrent as well but silly me didn't care! We had a falling out a couple of months ago. I developed feelings for her and I was honest with her about it and put myself in a vulnerable position and made it clear I did not expect the same feeling in return I just felt like I needed to get it off my chest. So she said \"I'll respond back to this asap!\" Then nothing. A week later I reached out then she responded \"you completely overwhelmed me and i didnt know what to say or do\" then going off about a ton of things that had nothing to do with me at all. I understand if it was a lot..but I didn't understand why she couldn't have just told me that from the start. I thought we had each others full trust and could be open with each other! So I finally asked if she didn't want to talk to me anymore, if so It's fine I just wanted to know so I won't be a bother! Then she blew up on me about all the problems in her personal life again.  About a month later she reaches out to me, and after making small talk I apologized, and let her know I just wanted to go back to how things were. Now that time has passed I realize I should never have to apologize for telling someone how I feel. I was just so terrified of losing as her completely that I thought it would be best. She messages back and says \"I need you in my life and I need you to know that I'll respond back asap I promise it won't be like last time I swear on my dad I will I love you.\" Then, nothing!! So I had enough and asked her \"Why do you do this?\" then her response was \"Clearly this is very hard for me to broach and I feel like clearly you want something out of this otherwise you wouldn't keep bringing it up\" when all I was trying to do was mend the friendship. Well, she blocked me immediately on every social media platform, and blocked my number. It has absolutely destroyed me and I have never felt so heartbroken in my life. It's made me question my sanity, it's made my self esteem completely go away, I have no confidence anymore and I never want to be vulnerable with anyone else.  I find myself questioning our dynamic as well. It seems like I was just her safe space. Someone she knew would always be there and never judge her no matter what. I was more than likely used for constant emotional support and validation which she seems to feed off of. Heck, she's even shown me screenshots from other guys calling her out for the same behavior and I completely ignored that red flag because \"oh there's no way she would do that to me!\" I'll cherish the memories we made together, but that's all she is now. Just a memory. I can't stop thinking about it. I have never felt more hurt in all of my life. I just have to remind myself that I don't deserve to be treated like a doormat by anyone, nobody does. I hope we both start feeling better soon! It's very hard.",
        "created_utc": 1722788238.0,
        "author": "Curious_Read4134",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lggyfu0/"
    },
    {
        "id": "lggbl1n",
        "body": "I’m so sorry :(\n\nI agree with you, it’s the worse “break up” there is.",
        "created_utc": 1722780153.0,
        "author": "RisetteJa",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lggbl1n/"
    },
    {
        "id": "lgg2dl6",
        "body": "Yes. I haven’t done it for like a month though. The only way I would stop was by uninstalling all social media and telling myself each time I went to redownload it “I don’t want to see it, and I don’t need to”. If you need to be active on social media then block the ex friend. (It’s a lot more painful to be blocked than to block). If you have each others numbers that’s the route for communication in the future if it is needed. The only thing you can get from continuing to follow her on social media is pain and a constant reminder of your loss. Absolutely no need. My life’s so much better without social media. If I really am wondering what someone is doing I send them a text or give them a call and it is so peaceful.",
        "created_utc": 1722776335.0,
        "author": "New-Baby-7377",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejocs4/how_do_you_deal_with_the_happy_memories/lgg2dl6/"
    },
    {
        "id": "lgg0y2l",
        "body": "This is so interesting. I had a similar dynamic with my ex best friend, but the opposite. She always looked after me and was basically a second mum. I had never had a friendship like this before but I was perfect for the dynamic. I have adhd and anxiety and am so chaotic and clumsy. She enjoyed taking on a mother figure and it worked perfectly. We shared everything with each other and for the most part supported each other in everything. I completely idolised her, thought she was the strongest person ever and loved her so much, and she did me. While she did a lot for me, I also was always there for her whenever she needed it and did a lot for her.We were very happy as best friends and became like sisters. \n\nHowever we became part of a group and the close knit bond we had formed dissipated within the group. I really struggled with this because I missed when it was just us two and (selfishly) wanted her to myself. However we all got very close and it was perfect. However I went through a difficult time getting in and out of relationships, health issues, in and out of bad jobs. I was basically just a mess. I for  sure relied on her way too mcuh and started to feel it. I always had an issue and the people I lived with suffered to. I lived with her so it was difficult to manage for both of us. I isolated myself when I had a lot of work to do after thee years of friendship and instead dumped everything on my new boyfriend at the time. I became selfish with my time and utterly hyper focused on my work. I could feel growing resentment from her and I felt like she was talking about me with the other people in the group. These people were basically my family at this point so I was heartbroken when I found out they were talking. \n\n But I think my actions didn’t reflect how I truly felt about them. Because I loved them so much, but I couldn’t bring myself to be upbeat and happy with them so isolated myself and thought they would have more fun without me. Anyway the friendship ended because I confronted her about talking behind my back and how it was making me uncomfortable. This was not taken well and they basically cut me off and we both said horrible things to each other. I moved out of the house and only spoke/argued with them over bills and stuff like that. It’s been 3 months now since we spoke. \n\nIt’s only now I realise how unhealthy the friendship was for everyone involved. I was in a terrible place and unable to make decisions or anything independently because I had grown to be codependent on my friend. I had never been like this with anyone else so I think it just grew from our dynamic and living together for so long, combined with my poor mental health with added life stressors. I think our friendship needed a huge reset and I need to heal myself before I ever thought of reconnecting. But we said bad things so im processing it as if she’s completely done with me. I regret how I acted and it’s something I need to work on. I also think I need to work on boundaries because having a friendship that close is not always a good thing when you go through  an extended period of poor mental health and can result in emotional damage. I feel terrible for everything I put my close friends through and wish I made more effort to make them feel valued and appreciated.  I’m glad I can grow and change and I for sure learnt the lesson to never be that person again. Sorry you had to go through this",
        "created_utc": 1722775682.0,
        "author": "New-Baby-7377",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1dhyo9z/how_is_everyone_doing/lgg0y2l/"
    },
    {
        "id": "lgfx110",
        "body": "I wouldn’t recommend deleting any past photos. You never know what could happen and this person might well come back into your life down the line. You had happy memories with her and don’t forget that just because you are heartbroken because you may regret having a whole section of your life missing. When you’re old you may want to look back at your memories and the special impacts this person had on your life. You may even reconnect and look fondly at old memories together. I think you should give her time, grief does weird things to people and she may have been having a rough time for a while and isolated herself. Let her know you’re always there and leave it at that. Losing a family member can do weird things to people and her grandma may have been ill for a while. However, you should also put yourself first and accept you need to process your own grief and fully accept that your friendship may be over. If you do not do this, you may be setting yourself up for pain if she truly does not return to the friendship. If she does return, if you have processed the ending of the friendship, you can decide whether to proceed and it will harbour a healthy relationship as you get to know one another again in a different context and you are not holding on to resentment due to her abandonment. It’s a win-win to begin to process the grief and come to peace with it. But it’s not an easy process.\n\nDefinitely limit yourself from looking at the photos or store them in an album somewhere. I deleted all my social media because it was more painful for me to see what she was up to currently. This was the best decision I made and I really don’t think I’ll ever redownload them. Your brain needs to register that you had this person in your life and now they are not around. In your life, they no longer exist. I found this to be the most effective way to speed up the process of processing the emotions mentally. You can keep old memories of them but you have to make an attempt to disconnect them from your life right now. I know exactly the sinking feeling of looking back at old memories and going “hold on, things weren’t meant to go this way”. Also remember that everything captured online, in a birthday post, or even old photos, will likely only present the amazing parts of the relationship you had so your brain can be confused and over romanticise the relationship leading to more pain. You need to give your brain time. Disconnect from the person first, allow yourself to really grieve. Cry and treat it as if you lost someone because you did. Allow yourself to feel sad and talk about it with others. I found it helpful to run through the stages of grief in my mind and place myself along the scale. I was in denial for a long time and I couldn’t feel sad because I just couldn’t accept it had happened. Now I am in the depression stage. It sucks but honestly it’s really helpful because I feel like I have progressed and moving ever closer to that golden acceptance stage. (I know grieving is not linear, but imagining it like this helps me to extract something good from how I am currently feeling and be optimistic about the future). I hope this advice helps you, I am not a professional by any means but I have done a lot of research and these are just the things that have helped me. I love this subreddit because we can all relate and I never thought a friendship breakup would be this hard but it really is. All the emotions. Let me know how it’s going! <3",
        "created_utc": 1722773793.0,
        "author": "New-Baby-7377",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ejocs4/how_do_you_deal_with_the_happy_memories/lgfx110/"
    },
    {
        "id": "lgftn1p",
        "body": "An excellent excerpt, and I'm glad you've found something to help. I've processed a lot of the grief already, but it's still nice to be reminded that we're not alone in this process",
        "created_utc": 1722772014.0,
        "author": "BugbearBro",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1ejhdav/book_rec_for_anyone_who_has_been_ghosted/lgftn1p/"
    },
    {
        "id": "lgfjz1l",
        "body": "People's feelings towards a person, can remain the same for years unfortunately, even if that person has changed for the better",
        "created_utc": 1722766004.0,
        "author": "Exciting_Way_5087",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgfjz1l/"
    },
    {
        "id": "lgfhapb",
        "body": "Dumping friends is a bad look. Most of the time, they make up self-serving reasons that make them look better than they are to justify it. The truth is probably that one of those two friends wanted exclusive access to the other one, and pushed you out of the nest to get it.",
        "created_utc": 1722764154.0,
        "author": "SpaceCommuter",
        "score": 7,
        "permalink": "/r/lostafriend/comments/1ejfbcm/i_found_out_after_years_of_wondering_what_i_did/lgfhapb/"
    },
    {
        "id": "lgf95sc",
        "body": "Know the feeling. It's not a single person I am avoiding. I've got around a dozen people that I would avoid in public... it was the one I thought was my best friend that pushed me here to this sub... and that one's the worst of the bunch, by so far, but I wouldn't enjoy seeing any of them up and around - in fact, I have decided I am never going to a High School reunion. So you're definitely not alone...",
        "created_utc": 1722758528.0,
        "author": "Lifelacksluster",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejktcz/terrified_of_bumping_into_old_friends/lgf95sc/"
    },
    {
        "id": "lgf8hn0",
        "body": "Yeah I’ve taken down our photos together and stuff, she won’t be back in my life so apart of me just want to delete all the digital stuff as well?",
        "created_utc": 1722758079.0,
        "author": "giraffe2035",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejocs4/how_do_you_deal_with_the_happy_memories/lgf8hn0/"
    },
    {
        "id": "lgf7dz5",
        "body": "I’ve thought the same thing. Maybe time it will be easier. Kind of like pics with an ex…hide them away or get rid of them… not sure. ❤️",
        "created_utc": 1722757344.0,
        "author": "AffectionateLars",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejocs4/how_do_you_deal_with_the_happy_memories/lgf7dz5/"
    },
    {
        "id": "lgf7479",
        "body": "It can definitely take the other person many months, or even years to reflect on it. Hopefully your former friend is able to reconnect the friendship you had. It will take a long time to rebuild again from scratch but hopefully you can do. \n\nWell done for taking years to do so, it shows maturity to do that, unfortunately I reached out too much at the time and a bit after too, not tried to in 3 months now and have no intention of contacting my former friend, as I don't wish to hurt her more than what I already did. I never once deliberately hurt her and have never once, deliberately hurt anyone though.",
        "created_utc": 1722757166.0,
        "author": "Exciting_Way_5087",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ecm580/how_long_did_it_take_you_to_forgive_yourself_for/lgf7479/"
    },
    {
        "id": "lgf6edq",
        "body": "I’m so sorry. Once in a while I’ll come across old text messages between me and my ex-best friend and it’s so sad.",
        "created_utc": 1722756685.0,
        "author": "Specialist_Worker444",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lgf6edq/"
    },
    {
        "id": "lgezknh",
        "body": "Thank you for understanding. This is the best xomment ive gotten so far. Yes, she was dealing with a ton of things and i believe she cant be her true self with those people. She often told me she felt her best self with me, and ofc as a friend i was really happy to hear that. I genuinely want her to be happy and not be around toxic people. I deeply care about her still even though we didnt see eye to eye on a lot of things. \n\nSadly, i dont think she would pick up the phone, i think that texting her or emailing her would be the best bet, but i dont know if its right.\n\nI know i got hurt and it caused me a lot of pain, but i am the type of character that would forgive instead of holding on to the grudges that i of course had at one point.",
        "created_utc": 1722752273.0,
        "author": "BlookyArt",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lgezknh/"
    },
    {
        "id": "lgeyz9f",
        "body": "I know the feeling, I've been in the same situation for some month now and I've never experienced so much emotionnal pain.  \nSome days I'm doing fine and then someone or something remind me of her and everything shatters and crumble again. And after 17 years of friendship, there's quite a few things that remind me of her \n\nTherapy helped a lot but the grieving is hard ... I've lost a lot of familly members over the years but it never hurt like that\n\nAt some point it do get easier tho  \nI wish you the best and to never experience that kind of pain again",
        "created_utc": 1722751913.0,
        "author": "daydreamerbeats",
        "score": 7,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lgeyz9f/"
    },
    {
        "id": "lgexlnn",
        "body": "Thank you. Sounds like an incredibly hard position you were in! Ah always tough just putting yourself back out there, but I know it must be done",
        "created_utc": 1722751082.0,
        "author": "zebrasnake3",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ejktcz/terrified_of_bumping_into_old_friends/lgexlnn/"
    },
    {
        "id": "lgevn56",
        "body": "I went through a rough friendship breakup, where I lost all of my friends in my hometown. Even today, I am still worried about running into them, but honestly you just have to push past it. I try to focus on the idea that none of it was my fault, and I am living a better life. I think about how I deserve better, and that I am strong enough to not engage, and stand my ground.\n\nAbout the avoiding making new friendships, it is completely understandable to be afraid! But try not to limit yourself too much. Try going to a community center and finding people who enjoy the same things as you. If you live in a big city, im sure there are events for whatever hobby you have! Get out there, and put the bad behind you!",
        "created_utc": 1722749950.0,
        "author": "Longjumping_Quail_22",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ejktcz/terrified_of_bumping_into_old_friends/lgevn56/"
    },
    {
        "id": "lgetl9x",
        "body": "She replied a decently lengthy reply but at the end said she wasn’t sure if she had more to say to me now or ever and that she would take time to reflect and decide if she had any more to say or not. I replied to that saying i understand and no pressure etc. but if by some miracle whether now or in 5 years time she felt like reaching out I would always be here. \n\nI understand, I think if I apologized years ago it would have gone like you. I took years to reach out because I had to grow enough and change enough to truly understand what I did and to be confident IF she accepted me back into her life there was no chance of something like that happening again, for her sake. I also didn’t really try to explain much nor try to win her back, mostly just talked about what I realize I did wrong and saying sorry for all those things. \n\nMaybe you can wait a while, a year or two and then try again? Things might be too fresh and not enough time has passed for her to believe you have changed. I wish you luck and hope it works out for you either way and sorry this has happened",
        "created_utc": 1722748778.0,
        "author": "5915407",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ecm580/how_long_did_it_take_you_to_forgive_yourself_for/lgetl9x/"
    },
    {
        "id": "lger9qf",
        "body": "Thank you for your support 🙏🏻 it’s a big leap to find someone new but I know it will be best for me. Love and light ✨",
        "created_utc": 1722747500.0,
        "author": "goldcuriousity",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lger9qf/"
    },
    {
        "id": "lgelbhd",
        "body": "So relate.",
        "created_utc": 1722744395.0,
        "author": "Automatic_Reply2563",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1e1c2cu/what_hurts_the_most_is_realizing_how_wrong_you/lgelbhd/"
    },
    {
        "id": "lgea1yk",
        "body": "That’s next level cruel! wtf. I can imagine the mental spiral I’d be in over the card and subsequent ghosting.  Like, did she mean it when she wrote it and actually have no clue she was close to ditching you? Which would be a stunning lack of awareness. Or did she know and still lie by writing that? I can’t. Feeling for you… *hugs*",
        "created_utc": 1722739197.0,
        "author": "snowbugolaf",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lgea1yk/"
    },
    {
        "id": "lge878x",
        "body": "People are unpredictable and sometimes the people we have known the longest and closest turn against us. My bff of 20 years suddenly went cold on me. So I know how much it hurts. But there is nothing we can do. We can't control them or the situation we can only try and control our emotions and maintain our peace. It's fine to go through grief. It's natural. Be kind towards yourself. This too will pass and you will make new friends and have new life experiences. Don't worry.",
        "created_utc": 1722738393.0,
        "author": "earlybird-2301",
        "score": 6,
        "permalink": "/r/lostafriend/comments/1ejfbcm/i_found_out_after_years_of_wondering_what_i_did/lge878x/"
    },
    {
        "id": "lgdykd4",
        "body": "You can’t ever go back to what once broke you.",
        "created_utc": 1722734394.0,
        "author": "Flinestonevitaqueen",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1d4lcuv/if_your_exfriend_reached_out_wanting_to_be/lgdykd4/"
    },
    {
        "id": "lgdt72m",
        "body": "I'll tell you right now that if you have someone like that in your friends list that it is most likely a good idea to think about finding someone new or several other people that you can socialize and talk with. Something similar happened to me where she would be a little controlling but I was also in the wrong and after me and her stopped talking I also felt miserable for months thinking about what had happened and even scrolled through our old messages just so i could see that at one point she did like talking to me snd was there with me always. Just don't put the blame on yourself and if it gets to a point maybe talk to family and friends about jt and they could help you get over the situation. I know it can be hard but trust me eventually everything will feel alright or as alright as it can be for you.",
        "created_utc": 1722732206.0,
        "author": "Emily1234201",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lgdt72m/"
    },
    {
        "id": "lgde1wt",
        "body": "You have the most important person of all to change for. Yourself. Plus all the people you may care for in the future.",
        "created_utc": 1722726337.0,
        "author": "Realistic-Jello6433",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgde1wt/"
    },
    {
        "id": "lgdbaax",
        "body": "Don’t feel guilty for caring. I don’t know her, but it sounds like she was dealing with some pretty heavy stuff. And while it’s unfortunate that so much went down, it sounds like she was a pretty good friend. \n\nDon’t hesitate to reach out to her. I definitely think the conversation is worthy of a phone call.",
        "created_utc": 1722725290.0,
        "author": "blueeberrrypie",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1ejdbgu/my_best_friend_ghosted_me_a_year_ago_because_she/lgdbaax/"
    },
    {
        "id": "lgd7ivt",
        "body": "Thank you. You too.",
        "created_utc": 1722723884.0,
        "author": "New-Baby-7377",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1eiabhn/will_i_ever_be_happy_again/lgd7ivt/"
    },
    {
        "id": "lgd71cp",
        "body": "I understand you 100%, its a life lesson for sure.",
        "created_utc": 1722723701.0,
        "author": "Pleasant_Morning_819",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lgd71cp/"
    },
    {
        "id": "lgd6sdq",
        "body": "I still have her birthday card to me from mid April saying she’ll be by my side for every one. The friendship ended at the beginning of May. Insane. I can’t imagine how I’ll feel when the next birthday actually comes around. I hope that this is at least character building and I come out of it funnier or something cos what actually is the point in this lol.",
        "created_utc": 1722723607.0,
        "author": "New-Baby-7377",
        "score": 7,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lgd6sdq/"
    },
    {
        "id": "lgd3vjm",
        "body": "Yes :( and yeah the guy is completely awful too. The whole situation is icky. Thank you for your support ✨",
        "created_utc": 1722722515.0,
        "author": "goldcuriousity",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lgd3vjm/"
    },
    {
        "id": "lgd34d2",
        "body": "I'm happy that she appreciated the apology, did you speak to her after that or did you just leave it? It takes a lot of reflection to truly realise where you went wrong, so well done on doing that. \n\nI have reached out a few times yes, but unfortunately she didn't care, however my apologies were genuine --- I should've given it many months, then apologised once, stating that I am now fully aware I was a dickhead etc and sorry for hurting my former friend. Instead, I tried to justify why my behaviour was that way.",
        "created_utc": 1722722230.0,
        "author": "Exciting_Way_5087",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ecm580/how_long_did_it_take_you_to_forgive_yourself_for/lgd34d2/"
    },
    {
        "id": "lgd1xce",
        "body": "The pain of losing a best friend is the worst pain there is. That person promised to be there no matter what in your life and now they aren't there. My sympathies to you. 🫂",
        "created_utc": 1722721782.0,
        "author": "Pleasant_Morning_819",
        "score": 10,
        "permalink": "/r/lostafriend/comments/1ejedeg/just_found_a_journal_entry/lgd1xce/"
    },
    {
        "id": "lgd1nul",
        "body": "And yourself isn't enough? Why is that?",
        "created_utc": 1722721685.0,
        "author": "Lifelacksluster",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgd1nul/"
    },
    {
        "id": "lgcy99h",
        "body": "I want to change. But I don't have anyone left to change for",
        "created_utc": 1722720452.0,
        "author": "depressedavacado",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcy99h/"
    },
    {
        "id": "lgcw2u9",
        "body": "Well, if she comes back... or doesn't. You have the decision to be the same person who got into this mess in the future or try to be someone else. It seems you are postponing making that decision, it's not a good look.",
        "created_utc": 1722719662.0,
        "author": "Lifelacksluster",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcw2u9/"
    },
    {
        "id": "lgcssiv",
        "body": "I was bored. Plus the people I have fun with r usually at school. I thought I'd drink then talk to them",
        "created_utc": 1722718490.0,
        "author": "depressedavacado",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcssiv/"
    },
    {
        "id": "lgcskp3",
        "body": "Why were you drinking at school?",
        "created_utc": 1722718414.0,
        "author": "Lifelacksluster",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcskp3/"
    },
    {
        "id": "lgcrr4o",
        "body": "Ik. Maybe it's not even the fact that she left. But that I couldn't think of a reason for her to stay. \n\nSo yeah go ahead",
        "created_utc": 1722718125.0,
        "author": "depressedavacado",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcrr4o/"
    },
    {
        "id": "lgcrnz3",
        "body": "Her flirting with him in front of his wife is the cowards way of telling her. But in the end it was the husbands responsiblity to say no. Alot of people tried to have an affair with me anytime im in a relationship. But its my duty as a mate to say no. So in that regards is it mess up yes, but she doesnt have to worry about that marriage as it has nothing to do with her. And she honestly sounds like a narcissist. Good luck OP.",
        "created_utc": 1722718093.0,
        "author": "Pleasant_Morning_819",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lgcrnz3/"
    },
    {
        "id": "lgcrdya",
        "body": "Well, she did get pretty hurt over this... and that decision isn't yours to make, it is hers. May I ask something?",
        "created_utc": 1722717997.0,
        "author": "Lifelacksluster",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcrdya/"
    },
    {
        "id": "lgcoa7i",
        "body": "i cant see a reason for her to ever come back",
        "created_utc": 1722716903.0,
        "author": "depressedavacado",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcoa7i/"
    },
    {
        "id": "lgcl70e",
        "body": "Thank you for your response 🙏🏻 yes I think you’ve identified it very well: that has been far more neurological than anticipated. This has been a very complicated and confusing experience, and I also feel a lot of guilt because I don’t make decisions rashly. With that said, what she did and how her morality plays out was the final straw for me and I knew it would hurt me personally to keep people like her around in my life :(",
        "created_utc": 1722715836.0,
        "author": "goldcuriousity",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lgcl70e/"
    },
    {
        "id": "lgcklq2",
        "body": "Yes I think you are right that she sees me in that role ❤️ with that said- she has been very draining to have as a friend in return. Unfortunately what she did is… pretty bad. I can’t say too much about the situation without it being an identifier, but it involves cheating, someone who is married, and hiding it. She does not feel remorse for the wife involved and has no intention of telling her what was happening for over a year. She has plans to flirt with the husband in FRONT of the wife (even after everything that has happened) when she sees them in person for an ego boost like a weird goal. It’s bad LOL. I have told her my opinion on this and she appears as though she doesn’t care at all. It scares me to find out she was capable of this :((\nThank you for your response ❤️❤️",
        "created_utc": 1722715631.0,
        "author": "goldcuriousity",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lgcklq2/"
    },
    {
        "id": "lgcixg3",
        "body": "I empathize with you. She sounds mad and maybe she just needs time. Really, only time will show because feelings change. She might be mad now, but she might get over it later.",
        "created_utc": 1722715049.0,
        "author": "Sudden_Connection291",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcixg3/"
    },
    {
        "id": "lgcgimn",
        "body": "Kid, you're both so young... and she went through something horrible, and she's not the same person after it. Her needs have changed, her outlook has changed... she needs to feel calm and in control right now, you trying to get her to talk to you isn't going to work out well... you've already tried to reach out and it hasn't worked out... the best thing I can advice you to do is to send a message just stating that you'll be there for her when and if she needs it... and leave it there, let her decide when she's ready...",
        "created_utc": 1722714205.0,
        "author": "Lifelacksluster",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcgimn/"
    },
    {
        "id": "lgcd9fp",
        "body": "maybe cus i dont want to change. She left cus i chose my bottle of alcohol over her, but thinking back i was scared, and i was trying my best to keep my life together and she was part of that life",
        "created_utc": 1722713060.0,
        "author": "depressedavacado",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgcd9fp/"
    },
    {
        "id": "lgccsp4",
        "body": "i have already written her  a note, and sent it on her insta, on an account she hadnt blocked, last week  \nshe blocked that account today\n\ni sometimes see her, but it hurts  \nwhen she left , she said this might be the last time we see each other  \nI was hopeful till she started slowly blockin me everywhere",
        "created_utc": 1722712893.0,
        "author": "depressedavacado",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgccsp4/"
    },
    {
        "id": "lgccgji",
        "body": "I'm sorry you're feeling hurt. Friendship breakups are hard. It'll take time to heal. \n\nIn your situation, I would send her a letter via mail, maybe even handwritten, that way it is more personal. Letting off your chest might make you feel so much better. I would make sure your tone suggests that and that there is no pressure for her to 'get back together'. Sometimes people are not brave enough to reach out especially if they ended things, she might be waiting for you because she doesn't want to be rejected if she takes the first step. You never know until you try. At least you'll find peace in yourself after writing a letter. Good luck",
        "created_utc": 1722712774.0,
        "author": "Sudden_Connection291",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1eixov2/should_i_reach_out_to_my_ex_best_friend_who_ended/lgccgji/"
    },
    {
        "id": "lgcc8s3",
        "body": "Welcome to your new home! If there is a local library, bring proof of residency (updated driver's license, utility bill, etc) and go sign up for a library card if you don't have one already. Ask if they have any programs happening soon -- some libraries offer more than just book clubs! They're usually low priced or even free events, too, and can be a chill way to meet new people. \n\nNot a great recommendation, really, but there is a friends version on the Bumble app to meet people nearby also looking to make friends. I've met a few folks through there off and on. \n\nI hope things look up for you soon!",
        "created_utc": 1722712697.0,
        "author": "Regular-Panic-Is-Hre",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1eiv56p/in_need_of_advice/lgcc8s3/"
    },
    {
        "id": "lgcax4y",
        "body": "I actually wrote all that I had to say to her as a huge apology in my notes app. After sitting on it for a bit, I put myself in her place and figured I would appreciate an apology if it were me. So I sent it to her and she seemed to appreciate me taking accountability and I believe the apology helped give her some closure. \n\nI doubt she would want to be friends again after all that I did but I think I made the right choice to apologize. Do you think you would ever message your friend(s)?",
        "created_utc": 1722712232.0,
        "author": "5915407",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ecm580/how_long_did_it_take_you_to_forgive_yourself_for/lgcax4y/"
    },
    {
        "id": "lgc9h2w",
        "body": "Why don't you chat with her if she is open? If I were you, I would send her a hand-written, heart-felt letter to let her know that you are remorseful about what had happened and that you would want to repair your friendship. Then, you wait, because time needs to pass before she feels she can talk to you.",
        "created_utc": 1722711723.0,
        "author": "Sudden_Connection291",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgc9h2w/"
    },
    {
        "id": "lgc7z2q",
        "body": "This sounds like a tricky situation. I'm sorry that this happened. It can be really hard to try to cope when you hurt someone you care about. It's a good thing that you are self-aware. What is holding you back from thinking you can change? Analyzing that may be a good start. I hope things start looking up. :)",
        "created_utc": 1722711194.0,
        "author": "Good-Cap-3396",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ej9qmn/i_keep_spiralling_and_dont_know_what_to_do/lgc7z2q/"
    },
    {
        "id": "lgbtxkf",
        "body": "Sounds like you were her safe space, maybe instead try explaining to her how wrong what she did is......maybe there is a logical reason for why she did it.",
        "created_utc": 1722706358.0,
        "author": "Pleasant_Morning_819",
        "score": 0,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lgbtxkf/"
    },
    {
        "id": "lgbhf4g",
        "body": "Maybe you could take yourself out in his honor. Birthdays are hard but it’s not a holiday for anyone except him. It’s a normal day and you deserve to treat yourself well.",
        "created_utc": 1722702090.0,
        "author": "crashboxer1678",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1eittt5/today_is_his_birthday/lgbhf4g/"
    },
    {
        "id": "lgbca35",
        "body": "You said it well. \n\nI don't have much to add, except to share an epiphany I had that the grieving process we go through when we lose someone is an intensely neurological process. It ultimately helps our brains prepare to accept new people into our lives who will replace the ones we've lost. If we didn't experience grief, we'd never move on. \n\nFor lost friends who are still living, it's a little jarring to realize you still have complicated feelings for them when you see them around. But ultimately, you also made room for new friendships in your heart, and that's the biggest positive that comes out of this process of loss and recovery.",
        "created_utc": 1722700320.0,
        "author": "SpaceCommuter",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ej3pic/i_cant_believe_how_much_this_is_effecting_me/lgbca35/"
    },
    {
        "id": "lgb9fpf",
        "body": "Honestly if she hasn't reached out in a year your safest bet is to let it go! It sucks but she doesn't care or else you'd of heard from her and a year is a long time.",
        "created_utc": 1722699359.0,
        "author": "ouelletouellet",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1eixov2/should_i_reach_out_to_my_ex_best_friend_who_ended/lgb9fpf/"
    },
    {
        "id": "lgb2p1d",
        "body": "Hey OP, I'm not sure how often you've moved away from home to live abroad (I'm assuming this is what you mean here), but losing touch with people \"back home\" is a natural part of living abroad, or at least, living too far away to comfortably hang out with each other. \n\nFrom my own experience (I've done this a couple of times), there are friends who don't do long distance friendships very well and will not actually make an effort to keep in touch with you regularly or at all. There are friends who know their limits socially and will already wish you a proper farewell, with or without the promise to catch up again, should you find yourself back in the country or closer to home. A rare few will make the effort to stay in touch and want to know more about your new life, either keeping up the connection out of genuine love and interest or until they feel you have settled in and possibly don't need them anymore.\n\nAs you can tell, it is quite the lucky immigrant, emigrant or expat (whichever you prefer), who still manages to remain good friends with those they leave behind \"back home\". If you feel like you have one or two friends \"back home\" who are still strong connections, message them and express how you would like their support during this difficult time trying to settle in to a new place. If they can support you, great! If not, I would suggest going to a local meet-up event for people in a similar position or even chatting in subreddits to find those who have experienced what you're going through already after they \"left home\".\n\nI'm a bit long in the tooth now, and only really keep in touch with 1-2 people from abroad - usually when I'm about to visit the country or when something important happens. In the meantime, I made my friends here and I have my hobbies. Once you have those sorts of things available to you locally, you'll find yourself unable to keep in touch with the friends \"back home\". The circle of life!",
        "created_utc": 1722697049.0,
        "author": "Successful_Gap_406",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1eiv56p/in_need_of_advice/lgb2p1d/"
    },
    {
        "id": "lgatxcc",
        "body": "I feel gross just reading this. I really hope her rich boyfriend does the same shit to her, only worse. \n\nYou deserve better!",
        "created_utc": 1722693858.0,
        "author": "SubSwitch76",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1b2q0d9/friend_to_lover_to_nothing/lgatxcc/"
    },
    {
        "id": "lga2ixy",
        "body": "I would say so send her an email if you have something you want to get off your chest without any expectations of anything. Don't let things weigh you down. If saying what you want to will make you feel lighter do it. Do what will be good for your mental health, not to get her back . If that means sharing your thoughts to her over an email, do it.",
        "created_utc": 1722680322.0,
        "author": "earlybird-2301",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1eixov2/should_i_reach_out_to_my_ex_best_friend_who_ended/lga2ixy/"
    },
    {
        "id": "lga296n",
        "body": "It is really difficult, I can imagine you also feel as though you have a lot to say to your former friend, to explain why your behaviour was the way it was. It's good that we have both changed for the better.",
        "created_utc": 1722680144.0,
        "author": "Exciting_Way_5087",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ecm580/how_long_did_it_take_you_to_forgive_yourself_for/lga296n/"
    },
    {
        "id": "lg9uun4",
        "body": "Sorry to hear about the fallout. I don’t think reaching out to her would be ideal especially if she was the one who ended the friendship.\n\nStick to “if they wanted to they would” rule. If she has not initiated anything, it may appear that she no longer wants to reconnect and reaching out to her would just reopen old wounds and won’t do you both any good.\n\nI wish you well in your healing journey!",
        "created_utc": 1722675066.0,
        "author": "NecoPeyi",
        "score": 8,
        "permalink": "/r/lostafriend/comments/1eixov2/should_i_reach_out_to_my_ex_best_friend_who_ended/lg9uun4/"
    },
    {
        "id": "lg9a63l",
        "body": "I’m so sorry you are going through this, I was in this exact position a year ago, and I just want to say that it gets easier. \n\nJust allow yourself feel how you feel, slowly wean yourself off checking their socials, you don’t have to stop immediately but you must stop if you want to move on.\n\nWhen you are ready, delete any pics you had with them as well, think about all the good times you had together with the understanding that it is over and more importantly forgive yourself, accept this was a fake friendship because someone who was truly your friend would never put you through this much pain, I wish you all the best and always here to talk❤️",
        "created_utc": 1722662009.0,
        "author": "Cuntysalmon",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1eiube8/postfriendship_break_up_grief/lg9a63l/"
    },
    {
        "id": "lg8i8w5",
        "body": "Thank you so much!! 💗 we are in no contact now. He didn’t reply to anything I said. He’s a dismissive avoidant, so he can’t handle confrontational conversations and pulls away to avoid them. He’s also moved to a new state and I’ve tried reaching out to apologize for confessing and trying to take accountability/be self aware that maybe I did the wrong thing. It hurts a lot, but I’ve done everything I could and I’ve left it up to him to reach out if he ever wants to reconnect. I appreciate you sharing your experience!!💗",
        "created_utc": 1722649024.0,
        "author": "Consistent_Actuary33",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1dtfbtu/i_miss_you/lg8i8w5/"
    },
    {
        "id": "lg8hp6g",
        "body": "I understand how you feel. I sent him a message for my own peace of mind. Regardless how one does it, I think you should go for that letter. If you feel like you left it defensive then you should try and fix it up one more time. After that, just leave it all alone. The response and reaction is up to them. It needs to go both ways, but doesn’t hurt to try your best. It will give you a lot of satisfaction knowing you did all you could. Might take a while to feel it, but trying is better than nothing. You can message me if you want to talk about this situation more! I’m happy to help you❤️‍🩹",
        "created_utc": 1722648800.0,
        "author": "Consistent_Actuary33",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1eiabhn/will_i_ever_be_happy_again/lg8hp6g/"
    },
    {
        "id": "lg8c70v",
        "body": "OP, you need to file a police report and get a test kit done at the hospital, immediately. I’m locking these comments. Please DM me who the user is and he is banned.",
        "created_utc": 1722646570.0,
        "author": "crashboxer1678",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1eim89t/your_toxicity_will_be_the_ending/lg8c70v/"
    },
    {
        "id": "lg8bx2b",
        "body": "wishing you the best!",
        "created_utc": 1722646458.0,
        "author": "a_bluebirdinmyheart",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehxenh/each_milestone_hurts/lg8bx2b/"
    },
    {
        "id": "lg8bvq8",
        "body": "thank you, same to you 💕",
        "created_utc": 1722646444.0,
        "author": "a_bluebirdinmyheart",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ehxenh/each_milestone_hurts/lg8bvq8/"
    },
    {
        "id": "lg7y2sb",
        "body": "Hey! I came to ur page looking for your story because of the comment u left on mine and wanted to give some advice. I was in the opposite shoe and wanted to give my perspective. It’s slightly different because this guy was in a relationship at the time, we were close friends for about a year and got drunk and confessed to me that he’d liked me the whole time in this kind of (what he thought) was a romantic gesture. This kind of shook me up, because I considered him a close friend, almost like an older brother. What he did kind of upset me because I felt like he betrayed his ex and also I felt a bit lied to. (Girls normally feel safer in friendships with guys in relationships for this very reason). \n\nI explained this to him and he basically replied saying he understands but if the feelings ever changed on my side he’d still be there. This majorly put me off because I felt like he’d just be waiting and I felt like I couldn’t talk to him about other guys like I used to cos it just felt a bit awkward? Everyone knows you can’t get over people that quickly, so to go straight from a confession like that to “back to normal” is strange for both sides. I left it a few months and then we met up. The vibes were just a bit odd and to be honest I just got the sense he hadn’t got over it. He talked about other girls he’d been seeing in a way that just felt like he was trying to prove something. \n\nSo I think what you really need to decide is could you really be friends with this person and watch them marry someone else, live a life with someone else? Or would that be painful for you? I didn’t think my friend would like that he already expressed to me he felt jealous when I saw other guys. This made me feel uncomfortable because I wouldn’t want to put him through that. In my case I felt the best thing to do was to just have space because I couldn’t shake the feeling he wasn’t over it. It would’ve been unfair to continue on either side. He blocked me on everything in the end. However I don’t think we were as close as you were, because I definitely am going through a worse friendship breakup right now. \n\nMy main words would be that you did the right thing confessing. If you hadn’t you would’ve caused yourself a lot more hurt down the line. Don’t beat yourself up about it. Give it time, for sure. And don’t feel that your ex friend didn’t care about you because that is very unlikely. If you have a true friendship time will give you both clarity and you will reconnect. He’s got to process it too. You can’t control your feelings you were honest and communicative with your friend. But you shouldn’t have any regrets and you obviously have lots of love to give, just be glad your saving it for the right soul <3",
        "created_utc": 1722641074.0,
        "author": "New-Baby-7377",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1dtfbtu/i_miss_you/lg7y2sb/"
    },
    {
        "id": "lg7tdjs",
        "body": "Thanks for your reply! Yes I’m doing everything I can to make it a bit better but the toll it’s taken is immense. I’m trying to imagine it like it’s a romantic breakup (for some reason this makes it feel better/validates how I’m feeling). People breakup/divorce all the time when they were once happiest with one another. But they move on in the end and find someone else and more suited to them and are happy again, or find happiness within themselves. This is what this feels like. I might reach out but honestly I don’t know if I’m ready to receive a harsh reply. But the way I left it I was very defensive. \n\nWe lived together and I moved out without speaking because the situation was too complicated and we were both going through exams so didn’t really have time to resolve it. Plus I went into a really weird headspace and didn’t feel up to confrontation at all. But there’s so much left unsaid and we both said horrible things that didn’t reflect the true nature of our friendship. So it’s weird to leave it like that? I was thinking of sending a letter but I don’t have her new address lol. Maybe an email? It’s more for my peace of mind that I won’t be checking read receipts or be caught off guard by it if that makes sense. A letter would be ideal though because I would never know when she got it and  it’s more personal. \n\nI would put everything into resolving it but she had more problems with me that I didn’t know about. Plus we were in a close group and she’s kept them, so I don’t think she needs me anymore :(. But who knows. Also I wouldn’t put it past me to just be romanticising the whole friendship because I always do that. I think I will have to be incredibly stable before i think about reaching out. Thanks for your advice :). Hope it gets better for u <3",
        "created_utc": 1722639294.0,
        "author": "New-Baby-7377",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1eiabhn/will_i_ever_be_happy_again/lg7tdjs/"
    },
    {
        "id": "lg7pffo",
        "body": "You will be happy again I promise ❤️‍🩹 I’m going through the same (although a bit different) and my mistake was relying on him for all my happiness. It does feel scary thinking you’ll never be happy again but it will happen. Don’t force it. It will take time. I’m not there yet either but allow yourself to cry, grieve, and get through those emotions first. There is always light at the end of the tunnel. Always. You just have to believe. Depending on how the miscommunication occurred and if reaching out will cause more issues I’d say don’t reach out but if it will help you to know you tried to reach out and try to fix things, you can reach out. I tried to reach out about 2 times but it’s cause  I had a lot I needed to get off my chest and I feel better and empty after (in a good sense). Take care of yourself❤️‍🩹",
        "created_utc": 1722637819.0,
        "author": "Consistent_Actuary33",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1eiabhn/will_i_ever_be_happy_again/lg7pffo/"
    },
    {
        "id": "lg7ndih",
        "body": "I ... I can't. There's more to this but I'm writing it down. Toxic would be letting him get away with grape, it would be letting him get away all the horrible things he has done to others. I can't let it go. I just can't.",
        "created_utc": 1722637066.0,
        "author": "LazulisVade",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1eim89t/your_toxicity_will_be_the_ending/lg7ndih/"
    },
    {
        "id": "lg7f9q0",
        "body": "This happened to me recently to and I also had the biggest smile on my face when she said she wanted to talk to me again. Had the calmest sleep since a while.",
        "created_utc": 1722634195.0,
        "author": "Emily1234201",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg7f9q0/"
    },
    {
        "id": "lg7djzy",
        "body": "Happy for you! Take it slowly :)",
        "created_utc": 1722633611.0,
        "author": "tiredofd",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg7djzy/"
    },
    {
        "id": "lg6y8qh",
        "body": "If you don’t mind, what happened between you two?",
        "created_utc": 1722628575.0,
        "author": "Amazing-Progress-936",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egaxgp/i_resisted_the_urge_and_im_glad_i_did/lg6y8qh/"
    },
    {
        "id": "lg6wh1m",
        "body": "God what this is grooming",
        "created_utc": 1722628003.0,
        "author": "JazzySharks",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg6wh1m/"
    },
    {
        "id": "lg6105s",
        "body": "pls find someone to connect to that is your age!!",
        "created_utc": 1722617967.0,
        "author": "Responsible_Bar8822",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg6105s/"
    },
    {
        "id": "lg55mov",
        "body": "Good luck, OP (I'm a firm believer of Rule 7 in this subreddit)",
        "created_utc": 1722607897.0,
        "author": "Successful_Gap_406",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg55mov/"
    },
    {
        "id": "lg55f1v",
        "body": "Hi there. Your story resonates with me. I was in your situation end of last year. It was also a gaming friend except we used to meet and play irl until he moved states, so it was mostly online but despite being far we still play together a lot and we often catch up when we visit each other’s states.\n\nMy friend was like a brother to me. We had a couple of arguments but always bounced back, the last one was no exception. I realized he started to pull away and things felt off. I suspect it was to do with our last argument so I tried to talk to him about it. I asked questions because I wanted to understand what went wrong. He said nothing but continued to push me away. I was confused and perhaps I pushed for answers too hard to the point he was uncomfortable. Only 2 months ago he said the friendship had given him too much anxiety and he wanted to demote me to superficial friends. At the end I backed off completely, aware the friendship is gone and there was nothing I can do but to let him go. \n\nPeople change and often outgrow friendships. Cherish those that still want to be in your life and forget those who don’t. It will get better in time!\n\nSending hugs your way xx",
        "created_utc": 1722607823.0,
        "author": "NecoPeyi",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ei9oem/best_friends_no_longer/lg55f1v/"
    },
    {
        "id": "lg5313f",
        "body": "Thank you for actually listening and helping...I mean, I've done what I could, time to let go ",
        "created_utc": 1722607005.0,
        "author": "None",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg5313f/"
    },
    {
        "id": "lg4lmov",
        "body": "Someone who doesn’t consider you a friend despite your apology, and who doesn’t give you the time of day, isn’t a friend you need. I would look into r/limerence for a different perspective, but I would say you should stop trying to force things to work with someone who isn’t meeting you halfway at all. The benefit of college is meeting new people (joining a club, sorority, new hobby, etc) and I hope you take advantage of that to start over.",
        "created_utc": 1722600242.0,
        "author": "crashboxer1678",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ehxer8/im_not_losing_hope/lg4lmov/"
    },
    {
        "id": "lg4l6vz",
        "body": "Someone who is naturally condescending and got on your nerves, jealousy or not, isn’t someone you need.",
        "created_utc": 1722600046.0,
        "author": "crashboxer1678",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehvtuy/i_was_the_jerk_but_i_dont_want_her_back/lg4l6vz/"
    },
    {
        "id": "lg4g9ox",
        "body": "I could have written all this myself. I’m not sure I’ll ever forgive myself because I don’t feel like I deserve to. It’s been 6 years already for me since I lost my friend who I mistreated",
        "created_utc": 1722597698.0,
        "author": "5915407",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ecm580/how_long_did_it_take_you_to_forgive_yourself_for/lg4g9ox/"
    },
    {
        "id": "lg449vb",
        "body": "Are you a troll? Or do you think it's ok to befriend a teenager as an 28yo? It's not, it's grooming, back the fuck off.",
        "created_utc": 1722590567.0,
        "author": "KourtR",
        "score": 11,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg449vb/"
    },
    {
        "id": "lg3us6k",
        "body": "💯 this, it is best if OP finds other friends his age & allow for that 17-year-old girl to live life without him.",
        "created_utc": 1722584279.0,
        "author": "Excellent_Hockey_149",
        "score": 8,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg3us6k/"
    },
    {
        "id": "lg3rlso",
        "body": "Thanks for sharing your dilemma. I'm going to answer you as someone who sees another person needing help with thinking something through. While I may not understand the full nuance of your friendship with this young woman, what I think I understand from reading your story is that you're somehow struggling with the mentor and friend dynamic in friendships.\n\nI've had a couple of friendships where there has been an age gap: The one that ended recently and which I talk exclusively about in this subreddit (we are opposite ends of the same decade) and one where the friend was in their 50s when I was just in my 20s. Both were women. While the former tended to stray more towards \"mentor\" in the final months (truly revealing the extent of an unhealthy respect from my former best friend's side and the foolish extent of arrogance on mine), my other friendship was an appropriate bond between two people who had experience in different lifetimes and could supportively share these experiences when needed (it was indeed one of the finest friendships I have ever had to date).\n\nWith this, I'm saying it is possible for women to have friendships with varying age gaps. Where the problem lies for men is that Western society, for instance, tends to view the same friendships between men and women with any significant age gap as questionable or unhealthy. In some cases, that indeed may be the case, but in others, it is a dying art, exhibiting healthy respect for the person who is youngest in the friendship. I struggled with that myself in my former friendship (I'm only human).\n\nTo what extent should you have been there for your younger friend's problems, particularly the romantic break-up? Well, it's hard to say, when the nuance of your friendship cannot be described in so few words. All I can say to this is... you couldn't have been her only friend, and I think it might have balanced things out if you had redirected her to someone closer to her age, perhaps a friend who had already experienced a romantic break-up at that young age. Or even suggested seeking the support of a trusted family member. It wouldn't have been abandoning your friend, but rather, it would have empowered her to put her eggs in different baskets, so that you wouldn't end up as you are feeling now: regretful that a friendship had to be ended because of this uneasiness you're starting to feel.\n\nAs an Internet stranger just offering an answer to the questions you've posed, I really encourage you to work on rebuilding your hurt self-esteem and focus on empowering yourself. The friendship has been formally ended. Your part is done. Exit stage left. Your young friend, you have to remember, can take care of herself. If you truly respect her autonomy and capabilities as a person, you, as a friend, should leave her to process the change in the friendship. In the future, she may look back on this moment as a \"growing\" event. And while she may not tell you for some years, or if ever, it is an event that often respects your maturity as the older adult, who, at the moment, has the life experience - and hopefully, the maturity - to do what is responsible and appropriate for the situation.",
        "created_utc": 1722582234.0,
        "author": "Successful_Gap_406",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg3rlso/"
    },
    {
        "id": "lg3pd68",
        "body": "Just under two years",
        "created_utc": 1722580842.0,
        "author": "ThrowRA_Field654",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg3pd68/"
    },
    {
        "id": "lg3o4pp",
        "body": "Until the end where you talked about battling demons I really thought this could be my person. My lost friend. I definitely left the last few texts unanswered. But I would be open to talking with her. I miss her all the time. But when we did almost reconnect things were never really addressed. So I couldn't trust that it wouldn't happen again. She even said she didn't know if we could be friends again. So I had to cut it off completely. If she contacted me and we discussed it, it might be different.",
        "created_utc": 1722580074.0,
        "author": "Bodees1979",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehmmds/its_been_so_hard/lg3o4pp/"
    },
    {
        "id": "lg3lage",
        "body": "Words of wisdom!!! All of this ⬆️⬆️⬆️",
        "created_utc": 1722578352.0,
        "author": "parislovebug",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehjzk0/feel_lost_and_heartbroken/lg3lage/"
    },
    {
        "id": "lg3iiv2",
        "body": "Hey, it's hard to break it out to you, but with all the love, I feel he doesn't want to continue this friendship. I know how much you value that friendship, however it looks like he doesn't want such a deep bond. You need to let go of this and move on. When people want to leave, keep the door open and let them go gracefully. \nIk it hurts like hell because you never imagined them leaving you, but whenever this happens it's us who are hurt, and keep on getting hurt. It's just going to make your life more miserable and desperate. \n\"If people wanted to, they would have\" just keep this in mind. By the facts you've done more than enough bro,and if the still don't see the value or worth you bring, they never will. You are worthy of better friendship who pour in you glass as much as you pour into theirs. It's a mutual effort. If they want to select Pride over this beautiful bond of friendship, let them.\nLetting go means making space foe someone better. \n\nI'm sorry If I was harsh, but trust me, going through exactly the same situation right now and I know it. All the best❤️ happy to connect if you want to talk more.",
        "created_utc": 1722576748.0,
        "author": "Lolwhatajokelmao",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehxer8/im_not_losing_hope/lg3iiv2/"
    },
    {
        "id": "lg3cuwu",
        "body": "You did the best you could and you were the best version of yourself that can you be. I wish you the best of luck and I hope it's going to be a good outcome!",
        "created_utc": 1722573667.0,
        "author": "hennykewell",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egajw7/sending_a_letter_to_an_exfriend/lg3cuwu/"
    },
    {
        "id": "lg36z5t",
        "body": "That's in inappropriate age gap. Full stop. Leave that child alone and learn how to make friends with other adults.",
        "created_utc": 1722570783.0,
        "author": "Routine-Present-3676",
        "score": 32,
        "permalink": "/r/lostafriend/comments/1ehzm7o/i_brokeup_a_friendship_and_now_im_dying_of_regret/lg36z5t/"
    },
    {
        "id": "lg306k2",
        "body": "I've heard other people's stories about friendships ending for trivial reasons. One was someone didn’t like that their friend dyed their hair. I had another friend who cut me off because I got a new hairstyle. They also tried to control what I eat, what I wear, what opinions I can have, how I talk, who I hang out with, basically anything in my life.",
        "created_utc": 1722567742.0,
        "author": "No_Pumpkin_4677",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdjy7/friend_ended_a_really_good_friendship_without/lg306k2/"
    },
    {
        "id": "lg2xuk0",
        "body": "For a minute I thought I had written this myself and forgotten. Dang. Going through the same.",
        "created_utc": 1722566756.0,
        "author": "snowbugolaf",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ehxenh/each_milestone_hurts/lg2xuk0/"
    },
    {
        "id": "lg2wj9n",
        "body": "Same, it's why I check this subreddit at all, from the delusional hope that they'd post here. I just want closure I know I'll never get. I want to know if I ever meant anything to them at all or if I was just a name on a computer screen. I want to know why they lied to me so much for no apparent reason. I want to know why they blocked me.\n\nI know it's pathetic and irrational but I keep doing it.",
        "created_utc": 1722566213.0,
        "author": "corbietalons",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lg2wj9n/"
    },
    {
        "id": "lg2wcaa",
        "body": "Happy for you <3",
        "created_utc": 1722566132.0,
        "author": "Purplebasic123",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg2wcaa/"
    },
    {
        "id": "lg2tvu1",
        "body": "I’m sorry you’re experiencing this. I’m going through the same thing, although mine might be a bit different as I had feelings for him and it ended up with him ending the friendship. I can relate to it all. So much has happened and he would’ve been the first person I’d tell. It really does suck and hurt. I have a lot of anger against him too. Feel all your emotions and I try punching a pillow or a punching bag when I want to get all my anger out. Tell someone else a loved one who will be happy for your milestones. I know it isn’t the same but your milestones deserve to be recognized and that will happen even if he isnt there anymore. Stay strong, you can do this ❤️‍🩹",
        "created_utc": 1722565131.0,
        "author": "Consistent_Actuary33",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehxenh/each_milestone_hurts/lg2tvu1/"
    },
    {
        "id": "lg2r2rz",
        "body": "thank you, same to you 🫶",
        "created_utc": 1722563997.0,
        "author": "a_bluebirdinmyheart",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehxenh/each_milestone_hurts/lg2r2rz/"
    },
    {
        "id": "lg2qzxr",
        "body": "I am sorry you feel this way. I completely understand what you are going through as I am also going through similar emotions. I hope it works out for you",
        "created_utc": 1722563966.0,
        "author": "superman359",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehxenh/each_milestone_hurts/lg2qzxr/"
    },
    {
        "id": "lg2exa6",
        "body": "This is a beautiful story and I'm glad you had the courage to post it. A lot of people don't understand how their absent affects the ones that truly love them. But you did a good thing! And you didn't cast any stones and choose peace over all else! That takes REAL strength, and I mean that. Emotional maturity is extremely difficult to find. I'm rooting for you! There's still hope! life is short but the human will to press on lives forever!",
        "created_utc": 1722559213.0,
        "author": "Wykkyd_714",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1egajw7/sending_a_letter_to_an_exfriend/lg2exa6/"
    },
    {
        "id": "lg2d9zp",
        "body": "You're right about all those things. It's very bleak and I do advise that this is the correct action. However, remember not to lose hope. Even if they are gone leave the door unlocked for if they ever decide to go back into your life there's a way. Don't hold hate or anger in your heart. Learn and grow, make new connections with other friends and yourself. There will be a day where you will connect again. Be ready with a kind heart, a big smile, and new progress in your life. Stay strong",
        "created_utc": 1722558593.0,
        "author": "Wykkyd_714",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehjzk0/feel_lost_and_heartbroken/lg2d9zp/"
    },
    {
        "id": "lg2c4g9",
        "body": "Keep your head up! Don't lose hope and stay strong! It's important to respect boundaries and not fall back into old habits. You're not alone in this there are so many people feeling the way you do! You got this there is hope",
        "created_utc": 1722558162.0,
        "author": "Wykkyd_714",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehmmds/its_been_so_hard/lg2c4g9/"
    },
    {
        "id": "lg2bkld",
        "body": "I would also like know",
        "created_utc": 1722557958.0,
        "author": "Wykkyd_714",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg2bkld/"
    },
    {
        "id": "lg2binz",
        "body": "I believe in not giving up hope in people and I can't imagine what you've been through. But look! It paid off in the end! Remember to keep cool and let it unfold naturally. I'm jealous, but from a stranger to stranger I'm happy for you.",
        "created_utc": 1722557937.0,
        "author": "Wykkyd_714",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg2binz/"
    },
    {
        "id": "lg22c54",
        "body": "Thank you for this response. I know now not to jump into a “friendship” when I know my heart wants something else. I just wish he could have realized that it was more hurtful to leave with no explanation at all. Slowly things are getting easier and less hurtful!! I just wish I could speed the process up a bit haha",
        "created_utc": 1722554510.0,
        "author": "_ghlost",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1egdeov/friend_ghosted_me_3_months_ago/lg22c54/"
    },
    {
        "id": "lg21l5c",
        "body": "I’m sorry the hear you can relate to how I’m feeling, i wouldn’t wish it upon anyone. I believe what you’re saying is true though—you can never know or assume what someone else is thinking or feeling. I think that’s one of the biggest lessons I’ve learned from this. I’ve also recently began considering I was somewhat of a surrogate girlfriend— he had mentioned to me that he has a weird view of relationships and codependency, and the more I think about it, the more I realize that he maybe used me for emotional support in his time of need. Hurts to say but it feels more and more true. I agree poor communication is the biggest red flag and ultimately I have realized a romantic relationship wouldn’t have worked between us.",
        "created_utc": 1722554233.0,
        "author": "_ghlost",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdeov/friend_ghosted_me_3_months_ago/lg21l5c/"
    },
    {
        "id": "lg1zub6",
        "body": "While I understand this from an outsider’s perspective with honestly little info (despite the length) it really isn’t the case. We spoke every day for roughly 8 months, and spent quite a lot of time together, including every holiday as mentioned above. I deleted over 5000 text messages between us when the friendship ended, and that was just between December-the end of April. We had many talks about what was going on in our lives on a daily basis, many of them discussing the hardships we were going through. In the short time we were friends, we *were* there for each other through thick and thin, and both expressed our appreciation for one another equally. I do believe it to be possible that he did find someone he was attracted to, but to downplay what our friendship was isn’t quite accurate. Fair perspective either way tho.",
        "created_utc": 1722553589.0,
        "author": "_ghlost",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdeov/friend_ghosted_me_3_months_ago/lg1zub6/"
    },
    {
        "id": "lg1wnu8",
        "body": "I sometimes wonder what i would do if my virtual friend contacted me again (long story short (i posted before if you want the long version) he ghosted me overnight without any sign of issue whatsoever, without a heads up, and without even responding “i’m alive, don’t write again” to my emails of panic thinking he was dead under rumbles in a massive earthquake.)\n\nPart of me would be curious to read what he had to say, gotta be honest. Not that i would necessarily be able to trust him again…\n\nOther part of me would want to tell him instantly to fuck off to space. Lol\n\nI’m happy for you tho! Take it slow :)",
        "created_utc": 1722552430.0,
        "author": "RisetteJa",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg1wnu8/"
    },
    {
        "id": "lg1jblf",
        "body": "I agree with what you said wholeheartedly. I just know most of us wouldn’t say these things in person to other people. Especially to someone they don’t know.",
        "created_utc": 1722547764.0,
        "author": "Working-Most8610",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lg1jblf/"
    },
    {
        "id": "lg1gquy",
        "body": "When you said that ghosting makes you feel worthless and start questioning and/or ruminating over all of your interactions with that person, I 100% felt that, because that’s how I’ve been feeling for the past month.\n\nSomething that I’ve always known but definitely came to the forefront with my experience is that we never truly know what another person is thinking/feeling nor how they view us - what we see as a friendship or potential friendship might just be an acquaintanceship or passing fancy for the other person. It really does suck to realize that you’re not on the same page as the person you’re in connection with but you’re right in thinking that it will get better one day and not feel so overwhelming.\n\nReading your story, I do get the impression that this guy sort of used you as a surrogate girlfriend until he found someone he actually wanted to pursue a romantic relationship with because, honestly, if you met on a dating site and got along this well, why on earth would you not have some level of romantic feelings for him and vice versa? Even the fact that it seemed he was continuously “not in a great place” emotionally and always had a lot going on lends itself to keeping some emotional distance between you guys. It doesn’t make the whole situation suck any less but if his communication is this poor when you guys are supposed to be friends, I would say you dodged a bullet in regard to this person being a potential romantic partner.",
        "created_utc": 1722546900.0,
        "author": "WasteofImagination42",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1egdeov/friend_ghosted_me_3_months_ago/lg1gquy/"
    },
    {
        "id": "lg14i8n",
        "body": "It’s not my fault that people get offended over words that are not offensive. It’s 2024, what else do you expect? 🤷‍♂️",
        "created_utc": 1722543110.0,
        "author": "Heavy_Pipe3150",
        "score": -2,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lg14i8n/"
    },
    {
        "id": "lg14dk7",
        "body": "Oh man. I went through something similar. I was unmedicated for almost a whole year, and I spiraled into a psychosis when my relationship became unstable with my ex. I lost ALL my friends during that time period. I apologized for how I acted and the damage I caused. No one owes me forgiveness, though. If I hurt someone I never ever expect forgiveness. I was actively rotting and losing my mind. It was the scariest thing I’ve ever experienced in my life and everyone I thought would always be there for me had left. \n\nI’m still upset about what happened, and I know there’s nothing I can do to make it better, so I just had to move in and create a new life for myself. I’m doing a lot better than I ever have been before. I’m so healthy and I’m with someone who is committed to love me through anything. He’s aware of my history and I explained to him how he could support me when things get bad or in unmedicated. He is extremely considerate and honestly relieves a lot of my symptoms because of how much stability he brought into my life. I still don’t have too many friends but I’m starting to prefer that because people are flaky and mean. I am so much happier now that I have a family, and school, and partner who supports me.",
        "created_utc": 1722543072.0,
        "author": "JazzySharks",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehia3l/blaming_myself/lg14dk7/"
    },
    {
        "id": "lg12wb1",
        "body": "I hope one day to share this blessing too",
        "created_utc": 1722542622.0,
        "author": "Lopsided_Flight_5585",
        "score": 7,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg12wb1/"
    },
    {
        "id": "lg0xude",
        "body": "I agree that it isn’t beneficial for someone to put so much emotional and mental weight on a person who doesn’t meet them halfway, but please say it in a nicer way for OP’s sake. Let’s do better to be compassionate towards OP, just as they would be compassionate towards your struggles.",
        "created_utc": 1722541084.0,
        "author": "crashboxer1678",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lg0xude/"
    },
    {
        "id": "lg0xerl",
        "body": "Well people should have self respect for themselves and stop caring about people that don’t care about them. It’s a waste of time and energy.\n\nAlso, just because it’s 2024 doesn’t mean I have to sugar coat everything.",
        "created_utc": 1722540945.0,
        "author": "Heavy_Pipe3150",
        "score": 0,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lg0xerl/"
    },
    {
        "id": "lg0u2qr",
        "body": "I am genuinely happy for you! Fingers crossed for you and may things get only better from here.",
        "created_utc": 1722539880.0,
        "author": "Euphoric-Music662",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg0u2qr/"
    },
    {
        "id": "lg0sdz1",
        "body": "Hope things work out for you! How long had it been since your friendship ended?",
        "created_utc": 1722539337.0,
        "author": "YAreUsernamesSoHard",
        "score": 6,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg0sdz1/"
    },
    {
        "id": "lg0n4zj",
        "body": "Take it slow. Lucky you!",
        "created_utc": 1722537674.0,
        "author": "crashboxer1678",
        "score": 8,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg0n4zj/"
    },
    {
        "id": "lg0liab",
        "body": "My point is, “Have some self-respect for yourself” comes across as very rude. Please rephrase it.",
        "created_utc": 1722537167.0,
        "author": "crashboxer1678",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lg0liab/"
    },
    {
        "id": "lg0if5c",
        "body": "There is no good in someone who betrays someone else. If that person truly was a good person and cared about someone then they wouldn’t have done what they did.\n\nPeople need to stop wasting time and energy on people like that. They do not give a shit about you so why care about them? Snakes only shed their skin to become bigger snakes.",
        "created_utc": 1722536218.0,
        "author": "Heavy_Pipe3150",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lg0if5c/"
    },
    {
        "id": "lg0h62y",
        "body": "Then make it easy and obvious. Things are only as difficult as you make them to be.",
        "created_utc": 1722535828.0,
        "author": "Heavy_Pipe3150",
        "score": 0,
        "permalink": "/r/lostafriend/comments/1egcelh/i_try_not_to_post_about_him_especially_on_my_main/lg0h62y/"
    },
    {
        "id": "lg0gwgs",
        "body": "I will say while this is valid advice, sometimes people don’t reach out due to pride. They want the other person to reach out first or for it to be a mutual effort of communication. I feel like unless one person was dead wrong expecting someone to be as black and white as “they didn’t reach out so they don’t care and want nothing to do with me,” isn’t accurate of human complexity.",
        "created_utc": 1722535747.0,
        "author": "Gatorguts345",
        "score": 8,
        "permalink": "/r/lostafriend/comments/1ehjzk0/feel_lost_and_heartbroken/lg0gwgs/"
    },
    {
        "id": "lg0ff0l",
        "body": "I will just add something about the situation is that the episodes were caused by a med change. I behaved out of character and when I brought my concerns to my psychiatrist he said that I should not worry and refused to take me off those meds. :// which really sucks",
        "created_utc": 1722535288.0,
        "author": "flodiee",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ehia3l/blaming_myself/lg0ff0l/"
    },
    {
        "id": "lg0f6v0",
        "body": "I often wonder what I would do if I ever saw my lost friend again. She was so good for me and it was over so fast.. Reading this gave me hope.",
        "created_utc": 1722535218.0,
        "author": "Terry_Dachtel",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1ehmqd1/my_friend_has_come_back_i_cant_believe_it/lg0f6v0/"
    },
    {
        "id": "lg097ge",
        "body": "The sooner you accept, the better it is. If they wanted to reach out they would have. If they wanted to continue the friendship they would have. If they missed you, they would have come to reconcile. \nIf people show you that you are nothing to them, then be nothing to them.\nIk it's easier said than done, I'm going through a same scenario where I thought we were brothers. But nothing above self respect. They are unbothered, than that is the closure for you. The disrespect is the closure. When people show then who they really are, accept it.\nYou will get through this, Letting go means making space for someone better.\nAll the best!",
        "created_utc": 1722533361.0,
        "author": "Lolwhatajokelmao",
        "score": 11,
        "permalink": "/r/lostafriend/comments/1ehjzk0/feel_lost_and_heartbroken/lg097ge/"
    },
    {
        "id": "lfzlnye",
        "body": "I said black panther 2 wasn't woke.",
        "created_utc": 1722525955.0,
        "author": "gucchiprada",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdjy7/friend_ended_a_really_good_friendship_without/lfzlnye/"
    },
    {
        "id": "lfziky0",
        "body": "It sounds like he cut you off to protect his own mental health. Prioritize getting help for your bipolar episodes. You can’t be a good friend if you are in a bad state of mind. Maybe sometime in the future when you get better, you can reach out again.",
        "created_utc": 1722524967.0,
        "author": "blueeberrrypie",
        "score": 10,
        "permalink": "/r/lostafriend/comments/1ehia3l/blaming_myself/lfziky0/"
    },
    {
        "id": "lfzclwe",
        "body": "I also had a friend who cut me off because I got a new hairstyle.",
        "created_utc": 1722523017.0,
        "author": "No_Pumpkin_4677",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdjy7/friend_ended_a_really_good_friendship_without/lfzclwe/"
    },
    {
        "id": "lfzb06k",
        "body": "True, I learned a very hard lesson from that lol, people are just so hypersensitive about seems like EVERYTHING nowadays. My dad always tells me to not give in to other people's drama. Boy, is he right! May I ask what happened between you and your friend over something as trivial as Black Panther?",
        "created_utc": 1722522480.0,
        "author": "No_Pumpkin_4677",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdjy7/friend_ended_a_really_good_friendship_without/lfzb06k/"
    },
    {
        "id": "lfyrabi",
        "body": "With respect for your feelings, allow me to play the role of Reality's advocate ( also known as Devil's advocate).\n\nYou met this man on a dating site and you hanged out a few times.\n\nYour friendship didn't start way back when. Your friendship didn't build over time, as a consequence of two people living their lives and sharing common experiences, and being there for one another through thick and thin.\n\nIt was a fling on a dating site, you got friend-zoned and one day he found other girls to kill time with and hang out with, and forgot about you.\n\nPlease allow this perspective, harsh as it is. You don't know this guy, you lost nothing but what you build in your head - quite a lot of it, by the length of your post.",
        "created_utc": 1722514968.0,
        "author": "Beverly__Crusher",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdeov/friend_ghosted_me_3_months_ago/lfyrabi/"
    },
    {
        "id": "lfy171r",
        "body": "You saying it’s ok really makes me believe that’s true. 💕",
        "created_utc": 1722499867.0,
        "author": "crashboxer1678",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1egcelh/i_try_not_to_post_about_him_especially_on_my_main/lfy171r/"
    },
    {
        "id": "lfy11d4",
        "body": "this is exactly what my other friend told me when i shared to her about my ghosting story.",
        "created_utc": 1722499761.0,
        "author": "Difficult_Play9203",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egajw7/sending_a_letter_to_an_exfriend/lfy11d4/"
    },
    {
        "id": "lfy10mt",
        "body": "I recognized an issue and posted here for support. Sure, it’s my sub, but I have weak moments too and it’s the avoidant behavior I have that’s the problem. I have self respect, don’t get me wrong. But even I struggle at times, and it makes it difficult for me to give others advice or support here. \n\nPlease, be kind. This is a supportive space and it always has been. Second comment from you about self-respect; I’m asking you to consider the person behind the screen and understand that what is easy and obvious to you may not be easy for/obvious to me.",
        "created_utc": 1722499747.0,
        "author": "crashboxer1678",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1egcelh/i_try_not_to_post_about_him_especially_on_my_main/lfy10mt/"
    },
    {
        "id": "lfy0p8q",
        "body": "This definitely reads more like a romantic relationship/breakup than losing a friend. Maybe r/heartbreak is the sub you need instead.",
        "created_utc": 1722499530.0,
        "author": "crashboxer1678",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egcelh/i_try_not_to_post_about_him_especially_on_my_main/lfy0p8q/"
    },
    {
        "id": "lfy0egh",
        "body": "Let’s remember rule 6. There’s a human being behind every screen - treat others the way you would want to be treated and give everyone a safe space to vent their feelings. There is such a thing as having self-respect and walking away from a friendship, and simultaneously missing someone no matter how toxic. Missing the good in them is often the case. Moving on is hard for some of us and it doesn’t come easily. \n\nWe’re all united here by a common pain. Let’s be kind to each other the way we deserve. u/Working-Most8610 let me know if the comments start to go sideways.",
        "created_utc": 1722499326.0,
        "author": "crashboxer1678",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lfy0egh/"
    },
    {
        "id": "lfxtv1w",
        "body": "In this case, it's more of b-word bride. Your friends may have stood by you, but maybe you were way worse to them than you realize. \n\nWere they genuine? Yeah. They didn't back away from being your bridesmaids. They sticked by till your wedding. However, I'm not defending their actions either. \n\nThey didn't backstab you. \n\nContinue going for your therapy .",
        "created_utc": 1722494956.0,
        "author": "gucchiprada",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1eh8ckg/backstabbing_bridesmaids_or_bitch_bride/lfxtv1w/"
    },
    {
        "id": "lfxt6ly",
        "body": "Let this be a lesson on how people can be so superficial and trivial.\n\nI **had** a friend who cut me off because I posted on Facebook a spoiler free review of Black Panther 2. \n\nYou never know what can turn people off.",
        "created_utc": 1722494525.0,
        "author": "gucchiprada",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdjy7/friend_ended_a_really_good_friendship_without/lfxt6ly/"
    },
    {
        "id": "lfxp8az",
        "body": "That’s why I left a particular hint in my post that only they would recognize.",
        "created_utc": 1722492040.0,
        "author": "Gatorguts345",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1egbw9a/i_sometimes_wonder_and_secretly_wish_that_theyve/lfxp8az/"
    },
    {
        "id": "lfxjd5e",
        "body": "I'm a heavy metal girl lol. Anyways, it was crazy and I found it quite shocking, to be honest. I can't believe I didn't notice any red flags in the friendship. I guess it was a blessing in disguise since she ended the friendship and I don't have to associate with her any longer since that's how she treated me.",
        "created_utc": 1722488594.0,
        "author": "No_Pumpkin_4677",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1egdjy7/friend_ended_a_really_good_friendship_without/lfxjd5e/"
    },
    {
        "id": "lfxfe4u",
        "body": "I believe if someone cut you off they probably experience feelings of shame. And now reaching out showing you are a honorable and decent human being, the shame gets even worse. I strongly believe people who do this is facing their own insecurities and is already battling feelings of low self worth. They’ll certainly not reach out after a letter like this. Unless the friend is a straight up narcissist it should still have an impact. Or they could be too coward to read it and throw it away.",
        "created_utc": 1722486484.0,
        "author": "damselbee",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1egajw7/sending_a_letter_to_an_exfriend/lfxfe4u/"
    }
]