[
    {
        "id": "lgvon3d",
        "body": "Ok so this is a really good question actually.\n\nStarting out, the trip was in June. The texting was in July. So yeah very new.\n\nBelieve it or not, she dumped a lot more on me than I did to her in our initial conversations (in-person and the first couple weeks of texting). And she was the one who initiated and made me feel comfortable opening up. I made sure not to overshare, until the ending obviously.\n\nI think what you said about it being difficult to be honest without hurting someone is what she was struggling with. I told her that she could tell me anything, including if she wanted me to stop texting for X amount of time, but I understand that it can be difficult to actually tell someone that. I agree that it's best to stop thinking about it. I have to accept that I'll likely never get the answers and closure I'm looking for. Thanks for your thoughtful response.",
        "created_utc": 1722998841.0,
        "author": "tthhrroowwaawwaayyk",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1elv2i9/closest_friend_ive_ever_made_softghosted_me/lgvon3d/"
    },
    {
        "id": "lgvlwhd",
        "body": "I'm sorry this happened and hopefully this can be a good learning experience. It's not clear from your post how long this friendship lasted, but especially if it was relatively new, you have to be careful with how much you're venting to or deeply sharing with a friend. I have been the recipient in this kind of situation, and it is uncomfortable and stifling to feel like I am constantly being put in the position of being someone's pseudo-therapist. Your friend certainly should have communicated that she felt you were putting too much on her, but speaking from experience, it can be harder than it sounds to be honest when you feel like you'd be causing even more hurt to someone who is already in a vulnerable position (even though you ended up hurt regardless).\n\nI think it's great that you're looking into finding therapy and trying to find other, healthier avenues for getting your thoughts out. You can't undo what happened here, and you're likely going to have to let go of any idea of a future friendship with this specific person, but it sounds like you're on a good track to develop healthier relationships down the line!",
        "created_utc": 1722997753.0,
        "author": "thefreecontestent",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1elv2i9/closest_friend_ive_ever_made_softghosted_me/lgvlwhd/"
    },
    {
        "id": "lgvlmmo",
        "body": "I really appreciate your perspective. Space being important is definitely something I've taken from this experience. I have to learn to shut down doubts in my mind and default to giving someone time. Thanks for the support ❤️",
        "created_utc": 1722997647.0,
        "author": "tthhrroowwaawwaayyk",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1elv2i9/closest_friend_ive_ever_made_softghosted_me/lgvlmmo/"
    },
    {
        "id": "lgvior3",
        "body": "I believe most friendship last a long time when they are not too close. Most friends that seem to have issues are ones where people are texting and talking every day. Space is a healthy thing.\n\nAlso you are very self aware and that goes a long way. Forgive yourself and move on. We all make mistakes.",
        "created_utc": 1722996501.0,
        "author": "damselbee",
        "score": 18,
        "permalink": "/r/lostafriend/comments/1elv2i9/closest_friend_ive_ever_made_softghosted_me/lgvior3/"
    },
    {
        "id": "lgvaowl",
        "body": "🩵",
        "created_utc": 1722993455.0,
        "author": "Embarrassed_Sell7512",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1elv2i9/closest_friend_ive_ever_made_softghosted_me/lgvaowl/"
    },
    {
        "id": "lgupwiv",
        "body": "My friend was snake and in the moment I dumped her ass but months later I’m realizing how big of an effect it was. It’s a lot of emotions and it takes alott of time",
        "created_utc": 1722985856.0,
        "author": "Safe-Imagination-511",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ajsxcj/what_is_a_unspoken_truth_of_losing_a_best_friend/lgupwiv/"
    },
    {
        "id": "lguprmv",
        "body": "It’s a lot harder than it seems",
        "created_utc": 1722985808.0,
        "author": "Safe-Imagination-511",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ajsxcj/what_is_a_unspoken_truth_of_losing_a_best_friend/lguprmv/"
    },
    {
        "id": "lguiq25",
        "body": "Maybe what u need is sending as a closure? I can relate to you a lot I usually feel so much better saying what I want and insure that they received it. If they think any less about u after than they did you a favor that you won’t see right now.",
        "created_utc": 1722983331.0,
        "author": "agirlgamer",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1elrbsj/having_a_bad_day_feeling_so_down/lguiq25/"
    },
    {
        "id": "lguhsar",
        "body": "I've been writing in the note app and editting and writing emails as if I were to send them. So many times. It does give me a release of energy but I still feel so much pain at times. Sometimes, I wish there was a button somewhere in my brain I can just mute.",
        "created_utc": 1722983006.0,
        "author": "Sudden_Connection291",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1elrbsj/having_a_bad_day_feeling_so_down/lguhsar/"
    },
    {
        "id": "lguggcn",
        "body": "Do not fight your feelings. Write everything your heart desire in the note app then look at it and see if it’s worth sending. Me personally, I will say whatever I want whatever the outcomes are. At least I can tell myself that I tried and the rest is out of my control.",
        "created_utc": 1722982548.0,
        "author": "agirlgamer",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1elrbsj/having_a_bad_day_feeling_so_down/lguggcn/"
    },
    {
        "id": "lgu08bk",
        "body": "I honestly thought something was wrong with me, i never expected to be that hurt losing a friend.\nThank you your words are reassuring",
        "created_utc": 1722977298.0,
        "author": "ZedGrimmie",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1els33s/how_do_i_get_over_them/lgu08bk/"
    },
    {
        "id": "lgtwsaf",
        "body": "I'm sorry you're feeling down. My friend broke up with me about 3 months ago and the pain is suffocating. \n\nWhat I found helpful is listening to podcasts and being on this sub and talking to a therapist. I've never been so broken before myself. Even a romantic breakup didn't hit me so hard. \n\nAllow yourself to grieve. It is normal. I used to think something is wrong with me, but these things are normal. Feel it, cry it out. Talk about it. That is how I cope.",
        "created_utc": 1722976235.0,
        "author": "Sudden_Connection291",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1els33s/how_do_i_get_over_them/lgtwsaf/"
    },
    {
        "id": "lgtmfta",
        "body": " I've decided to put myself first. I'm taking a break from trying to make friends. A lot of people expected and are expecting so much from me without giving in return, and I can't handle it anymore. On top of that, I have major trust issues and am in a really dark place. I'm starting to understand that true friends and family are the ones who are there for you when you are at your lowest. I was there for so many people at their lowest, but the second things got rough for me, they bailed on me. Hopefully, therapy, self-care, and time will help me heal, so I can learn to trust again. Your kind words really helped me today, so thank you for that. I hope you find enjoyment in solitude, but thar you can also find the true friend you are looking for. Wishing you all the best🫶",
        "created_utc": 1722973056.0,
        "author": "kurlyl0ck5",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1elkte5/feeling_a_bit_alone_these_days/lgtmfta/"
    },
    {
        "id": "lgt776l",
        "body": "That’s true. I need to learn how to be more independent I guess. Also, sorry to hear about your situation. Losing friends, especially long term friends, is hard. I’ll just say that time heals all. It might take a while but there will come a day when you don’t agonise over what you’ve lost so much and only look fondly at the good parts of your friendship. And you won’t find yourself alone for too long either. People have  way of finding connection and I hope you will make new friends too! Here’s to hoping things will work out for us 🤞",
        "created_utc": 1722968336.0,
        "author": "Sensitive_Tomato1348",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1elkte5/feeling_a_bit_alone_these_days/lgt776l/"
    },
    {
        "id": "lgt3l5h",
        "body": "I lost my only 2 very best friends in the last 9 months. The first one was a messy breakup. For the second one, I just realized that this friendship ran it's course and I didn't feel valued. These were long term (10+ years) friendships. I have no other friends. So I know how you feel. I find it's best to focus on doing things I love and just keep myself busy so I don't go insane over it. You can give yourself a spa day at home or a salon, read a book at a coffee shop, go to the gym or on a walk, etc. You have to learn to enjoy your own company because people come and go. It's a hard thing I've learned about life🫤",
        "created_utc": 1722967222.0,
        "author": "kurlyl0ck5",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1elkte5/feeling_a_bit_alone_these_days/lgt3l5h/"
    },
    {
        "id": "lgsyj8x",
        "body": "I’ve been in the situation twice and one time it worked out and the other time I lost the friendship. It really depends on the emotional maturity of each party.\n\nThe fact that you are openly talking about it and what you each need is a good sign. \n\nThe time it didn’t work out for me and my friend I previously had feeling for was due mainly to poor communication on both our parts. I sensed she was extremely uncomfortable talking about it so I gave her space for awhile. Once we started hanging out again things seemed normal for awhile, but then she started being inconsistent which was confusing to me. \n\nWhen I asked her about it and what she wanted  it became clear she couldn’t stop worrying that she was leading me on while just being friendly and she was avoiding talking about her dating life with me even though I told her she didn’t have to avoid it to spare my feelings. She would misinterpret my words and actions as indications I still had feelings for her and nothing I could say could reassure her that I only was interested in friendship, so I had to let the friendship go. \n\nInterestingly enough, her poor handling of the situation really helped me get over her because I’m not interested in being in a romantic relationship with someone that is conflict avoidant and can’t communicate their wants and need directly.",
        "created_utc": 1722965683.0,
        "author": "YAreUsernamesSoHard",
        "score": 5,
        "permalink": "/r/lostafriend/comments/1ekulh2/can_a_friendship_bounce_back_after_taking_time/lgsyj8x/"
    },
    {
        "id": "lgsu4qv",
        "body": "No context bro, if you could give more details as to what led to this instance it would be better to give advice",
        "created_utc": 1722964328.0,
        "author": "Lolwhatajokelmao",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1elmh7j/best_friend_told_me_fck_off/lgsu4qv/"
    },
    {
        "id": "lgsqrl5",
        "body": "I’m going to be an outlier here and just say follow your gut. \n\nI had a huge best friendship break up about 15 years ago that devastated me. There was no clean cut or specific point in the break up, just a lot of bad communicating and handling of conflict. I hated that it ended badly after such an incredible and rare friendship. \n\nAfter years I reached out to her and we met up but it didn’t quite feel right. But I was glad I did it / tried. \n\nThen years after that, ten years after our fall out, she reached out. We had an amazing 3 hour conversation and now, while we will never have the friendship we once had, we feel heard and are on positive, speaking terms. I’m so grateful. \n\nI know people love to say “if they wanted to they would” but I also think that people give their power away. If both sides think “if they wanted to they would,” no one ever will. Consider being the person who does. You may be surprised.",
        "created_utc": 1722963291.0,
        "author": "LilyPad1247",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ekhuly/having_feelings_of_wanting_to_reach_out_to_an_ex/lgsqrl5/"
    },
    {
        "id": "lgsqqkw",
        "body": "No context as to why you have fallen out, so there is that, and it’s been a two month friendship. I’d move on, and on a personal note, maybe toughen up a little.",
        "created_utc": 1722963283.0,
        "author": "undulating-beans",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1elmh7j/best_friend_told_me_fck_off/lgsqqkw/"
    },
    {
        "id": "lgshr42",
        "body": "I'm sorry you're feeling this way. It is common since we live in a busy and lonely world. I'm fairly independent but I do miss a frequent interaction with a friend and that recently ended and has been eating me alive. There are good and bad days. Today is such a bad day for me and I just need to cry. I wish I could talk to this friend who ended our friendship but I won't call them because they don't want to talk to me. They ended our friendship because they needed to be less dependent on me. It's really hard for me to accept this. I try to do different things to distract myself, I listen to podcasts, etc.",
        "created_utc": 1722960523.0,
        "author": "Sudden_Connection291",
        "score": 4,
        "permalink": "/r/lostafriend/comments/1elkte5/feeling_a_bit_alone_these_days/lgshr42/"
    },
    {
        "id": "lgsebs6",
        "body": "I had a friend from 10+ years we known eachother, two months ago we were in this D&D group together that runs on Sundays but our DM decides to cut me out because \"I wasn't, good enough and not taking part\" to which I was! And she blames ME for one of our players characters death which wasn't even my fault to begin with (it was all discussed between my friend and our DM beforehand) and now all that went down and my friend (now former) told me she's not going to be my friend anymore because I'm too much of a drama-queen and should just let these things wash over me, deep down of they cause me pain, I should just ig ore it and move on. \n\nHer way of saying it really hurt me so bad, and I almost ended my life because off it all",
        "created_utc": 1722959454.0,
        "author": "Meadow-Pathwalker",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ekdfdm/welp_its_over/lgsebs6/"
    },
    {
        "id": "lgs9s9u",
        "body": "Feel like I've been summoned...\n\nLovely outcome for your self-development, OP. Congratulations on the hard-earned milestones! Would love this for my own former best friend.\n\nLet me ask you something, though... what do you have in place to recognise old unhealthy patterns reappearing in the friendship, no matter how small, and what's the plan to set boundaries, just in case you both start to fall back into old patterns?\n\nCodependency is called \"co\" for a reason (your ex best friend was codependent on you, too). \n\nIf you're going to lay all your cards on the table in the hopes of rekindling friendship... try to do this once you know for certain you are doing this for yourself. Right now, how your post comes across to me, it seems like you're still seeking her approval, despite the fact that you've discovered love for yourself, and this comes from the words \"I don't want her to see my actions as premature\". \n\nThis is about you, remember? \n\nWhy do you need her to see your actions a certain way? She's not in charge. She's not the gatekeeper. So the conversation you're going to have... I would draw attention to just being confident in who you've worked so hard to become, and go into the conversation as if it wouldn't matter to you if she said \"no\". If this outlook isn't the case (e.g. you're really not looking for her approval, it's just the phrasing), my suggestion would still be the same.\n\nThen again, there's a rule in this subreddit against reaching out to the former friend... So in keeping with the rule, I would encourage you to reconsider whether all the cards should be shown, when you don't even know what cards your ex best friend could be holding.",
        "created_utc": 1722958020.0,
        "author": "Successful_Gap_406",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1ekyllm/need_advice_please_on_how_to_rekindle_friendship/lgs9s9u/"
    },
    {
        "id": "lgs8gc5",
        "body": "I do get that she is going through a very difficult time in her life but there is only so much you can do for her. By respecting your personal boundary you are teaching her that you will not allow her to use you. My personal opinion, it sounds like \"I don't want to be friends unless you let me sleep in your bed\" is just her trying to manipulate the situation to gain control because you didn't break your personal boundaries for her. ",
        "created_utc": 1722957599.0,
        "author": "PechePortLinds",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1el2gsc/moving_in/lgs8gc5/"
    },
    {
        "id": "lgs74zn",
        "body": "To me, sounds like there were 3 major problems: \n\n(1) Communication issue\n\n(2) Lack of respect for your tenancy contract\n\n(3) Lack of common sense\n\nYou seem very kind to me, OP, to share your home so soon with a woman you haven't known very long. \n\nThing is, it sounds like you're being used; thus the immediate declaration that your temporary housemate no longer wishes to be friends.\n\nWhat kind of formal conversation did you have about her even moving in? I'm pretty sure you would have told her where she's able to sleep, considering how, from the sounds of things, you don't seem to have a spare room, just a spare couch? And if she knew that, and she knows she doesn't like sleeping on couches, then how could it possibly lead to her moving herself and all her things (cat included) into your apartment, and yet look surprised to the point of cutting off the friendship? What's missing here?\n\nGiven how briefly you've known this person, I think jeopardising your tenancy agreement is not worth it. After all, the legal consequences fall solely on you, not this 'friend'. Look after yourself, OP. Don't be naive... \n\nAnd I'm not sure why this 'friend' couldn't move in with her own family or friends? If she had no one else to turn to, there are charities and women's shelters specialised in assisting. How come it had to be you to save her? If you haven't done so already, recommend them to your 'friend' but also ask on the side for some advice about your own situation. I do hope your 'friend' moves out when you ask and that you know what to do if she won't.\n\nedit: formatting",
        "created_utc": 1722957181.0,
        "author": "Successful_Gap_406",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1el2gsc/moving_in/lgs74zn/"
    },
    {
        "id": "lgs576h",
        "body": "Maybe it was how it was said. Maybe she was just sensitive to being told no /ejected out of the room. Maybe you could try/suggest the purchase of an air mattress set up in the main area off to one side as to offer some privacy for herself. It could be sensitivity during a difficult time but only way to know for sure would be to get answers from her. I think the mattress plus you asking gently might get you somewhere but idk for sure, give it a shot? Good luck 🍀",
        "created_utc": 1722956561.0,
        "author": "toni_stark88",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1el2gsc/moving_in/lgs576h/"
    },
    {
        "id": "lgs3ycx",
        "body": "There's a handful of people in here who fell into that grey area of female friendship. Thinking back, I think I was infatuated, not really in love. I was, how you say, \"professional\" when it came to my feelings. I always acted in the spirit of friendship and never did anything to proactively and openly flirt or try to win brownie points in the hopes of bringing our friendship closer to romance. I'm grimly satisfied I had done that. On my former best friend's side, however, she just kept pushing the boundaries, and her efforts seemed to only get more intense once her then boyfriend dumped her. It even came to a point where she saw nothing wrong with us sharing the same bed in a hotel room, even though I was like, I can't do that; if I'm going on this trip with you, we need separate beds. So when I disclosed my crush, the mild disgust in her voice as she told me she had never thought of us that way made me laugh without humour. She either had repressed feelings for me, or she never actually considered the consequences of her own actions and was happy enough to milk my \"affections\" for all they were worth, which she could not honestly bring herself to acknowledge. \n\nDon't get me wrong; my former best friend did make me feel special and appreciated as well, but I get the impression that perhaps yourself and your former friend had a healthier approach somehow... To me, at least, it comes across as if the two of you could tell each other about some concern in the friendship, and you both afforded each other the space to do that (or am I misinterpreting?) Towards the end, however, I will admit to having treated my former friendship more like a possessive habit. I haven't fully understood yet the root cause of this change. Something changed at that time for my former friend as well, and we just started to feed into it.\n\nGirls who become bitchy in groups at uni... ah yes, age-old tradition! This happened to an old friend of mine. I'm sorry it also happened to you. I would second looking askance at a \"controlling personality type\", though I'm not sure you can entirely stay away from them. Even people who don't tend to be controlling by nature can become that way when they get jealous. But it's good to recognise those types of behaviours and ensure you have your boundaries in place. What you learnt from the friendship demise is very valuable, particularly the codependency. That's how friendship with my former best friend happened to be, until I went to therapy this year and managed to break the pattern. It seems really dumb now, but _boundaries_ would have solved so many problems, right! Codependent friendships are complicated. It's hard to see how unhealthy something has become once ingrained in the friendship. I remember the eerie moment where my former friend said \"we\" instead of \"I\", before quickly correcting herself. That's how enmeshed we had become. When I was trying to converse with her like an equal, I got the uncomfortable sense that she didn't even know how to do that. And to this day, I wonder to what extent had I crippled her and to what extent had she crippled herself?\n\nYou're like a breath of fresh air to me! And as you can see, I could go on for ages as well, haha! Sure, let's chat some more about this. Get it all out of our system!",
        "created_utc": 1722956161.0,
        "author": "Successful_Gap_406",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1dhyo9z/how_is_everyone_doing/lgs3ycx/"
    },
    {
        "id": "lgrzyk2",
        "body": "Not your fault. They seem extremely manipulative and pushy in an uncomfortable way. Immature at best, but honestly just seem full of shit and have a lot of growing to do. I’d cut them off immediately.",
        "created_utc": 1722954864.0,
        "author": "Gatorguts345",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1elem6d/is_it_really_my_fault_this_friendship_failed/lgrzyk2/"
    },
    {
        "id": "lgru7jy",
        "body": "I had two friends on discord, then one of them blocked me over an incomplete d&d character sheet and that friend vented to a second friend about it so they blocked me too",
        "created_utc": 1722952946.0,
        "author": "F_l_ip",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1ekdfdm/welp_its_over/lgru7jy/"
    },
    {
        "id": "lgro2ov",
        "body": "I’d imagine his therapist, like his friends, are not privy to all this shit he’s done himself and only highlights the one thing I mentioned above wasn’t honest. You owe no one friendship, so if he did try and guilt trip that, block that fucker.",
        "created_utc": 1722950801.0,
        "author": "Potat_Dragon",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1elem6d/is_it_really_my_fault_this_friendship_failed/lgro2ov/"
    },
    {
        "id": "lgrno15",
        "body": "Thanks for the advice. I should have probably just said I don't want to be friends, I was just feeling bad for the person and also scared that they'd guilt me for this too\n\n\nWhat about the therapist, though? He also took the person's side",
        "created_utc": 1722950654.0,
        "author": "YakuZaishiThrowaway",
        "score": 1,
        "permalink": "/r/lostafriend/comments/1elem6d/is_it_really_my_fault_this_friendship_failed/lgrno15/"
    },
    {
        "id": "lgrmpcu",
        "body": "No, you are not at fault here. Your \"friend\" is someone so desperate for love and affirmation that they will trample anyone who gets in their way to find it. \n\nYou set boundaries, you asserted yourself, and spoke honestly. You did the best you could. \n\nAnd this \"friend\" threw your fears back at you. That's both manipulative and spiteful. \n\nEven if you did give this person a relationship, it would not take long before their low self-esteem started to dictate their actions, and you would be taken for granted. \n\nYou dodged a bullet.",
        "created_utc": 1722950304.0,
        "author": "-1829",
        "score": 2,
        "permalink": "/r/lostafriend/comments/1elem6d/is_it_really_my_fault_this_friendship_failed/lgrmpcu/"
    },
    {
        "id": "lgrivbx",
        "body": "I will point out saying you are still friends but also stuff like you won’t talk in VC or meet up in person ever isn’t exactly an honest conversation. \n\nYou call it a boundary but what it really is you no longer wanting to be friends with this person and it’s ok and valid!\n\nThat said, that’s the only point you did anything wrong in this scenario. They are obviously trying to push themselves as some kind of romantic interests despite your clear nos. You just need to be clearer on the fact you now you also don’t have platonic interests after their harassment.\n\nTheir friends are also fucking jerks. I’d get away from them and their flying monkeys asap.\n\n(Edit: I also only point out what you can do better as a way to help you take away some sort of growth from this horrible situation. They are harassing you and you should absolutely not tolerate it at all. I wouldn’t ever play nice with someone who can’t take a no like that)",
        "created_utc": 1722948863.0,
        "author": "Potat_Dragon",
        "score": 3,
        "permalink": "/r/lostafriend/comments/1elem6d/is_it_really_my_fault_this_friendship_failed/lgrivbx/"
    }
]